export const realWorksFromUploadedEstimates = [
  {
    "категория_работы": "Демонтаж",
    "наименование_работы": "Демонтаж гидроизоляционного слоя из рулонных материалов (средняя толщина 50 мм), с учетом вертикальных конструкций, с учетом демонтажа парапетных крышек. Демонтаж цементно-песчанной стяжки с теплоизоляционным, пароизоляционным слоем.",
    "единица_измерения_работы": "м2",
    "цена_0_300": 585,
    "цена_300_600": 585,
    "цена_600_1000": 585,
    "цена_1000_3000": 585,
    "цена_3000_6000": 585,
    "цена_6000_15000": 585,
    "цена_15000_30000": 585,
    "цена_более_30000": 585
  },
  {
    "категория_работы": "Демонтаж",
    "наименование_работы": "Демонтаж профилированного настила",
    "единица_измерения_работы": "м2",
    "цена_0_300": 180,
    "цена_300_600": 180,
    "цена_600_1000": 180,
    "цена_1000_3000": 180,
    "цена_3000_6000": 180,
    "цена_6000_15000": 180,
    "цена_15000_30000": 180,
    "цена_более_30000": 180
  },
  {
    "категория_работы": "Демонтаж",
    "наименование_работы": "Демонтаж Дефлектора",
    "единица_измерения_работы": "шт",
    "цена_0_300": 8000,
    "цена_300_600": 8000,
    "цена_600_1000": 8000,
    "цена_1000_3000": 8000,
    "цена_3000_6000": 8000,
    "цена_6000_15000": 8000,
    "цена_15000_30000": 8000,
    "цена_более_30000": 8000
  },
  {
    "категория_работы": "Демонтаж",
    "наименование_работы": "Демонтаж зенитных фонарей (1*2 м; 2 м2)",
    "единица_измерения_работы": "шт",
    "цена_0_300": 8000,
    "цена_300_600": 8000,
    "цена_600_1000": 8000,
    "цена_1000_3000": 8000,
    "цена_3000_6000": 8000,
    "цена_6000_15000": 8000,
    "цена_15000_30000": 8000,
    "цена_более_30000": 8000
  },
  {
    "категория_работы": "Основание",
    "наименование_работы": "Подготовка основания",
    "единица_измерения_работы": "м2",
    "цена_0_300": 100,
    "цена_300_600": 100,
    "цена_600_1000": 100,
    "цена_1000_3000": 80,
    "цена_3000_6000": 80,
    "цена_6000_15000": 80,
    "цена_15000_30000": 80,
    "цена_более_30000": 80
  },
  {
    "категория_работы": "Основание",
    "наименование_работы": "Устройство сборной стяжки в 2 слоя ЦСП в перехлест - 20 мм.",
    "единица_измерения_работы": "м2",
    "цена_0_300": 460,
    "цена_300_600": 460,
    "цена_600_1000": 440,
    "цена_1000_3000": 420,
    "цена_3000_6000": 380,
    "цена_6000_15000": 320,
    "цена_15000_30000": 300,
    "цена_более_30000": 280
  },
  {
    "категория_работы": "Основание",
    "наименование_работы": "Устройство армированной стяжки (армирование фиброй), уклон 1% + контруклон",
    "единица_измерения_работы": "м2",
    "цена_0_300": 1500,
    "цена_300_600": 1500,
    "цена_600_1000": 1200,
    "цена_1000_3000": 1000,
    "цена_3000_6000": 1000,
    "цена_6000_15000": 800,
    "цена_15000_30000": 700,
    "цена_более_30000": 600
  },
  {
    "категория_работы": "Основание",
    "наименование_работы": "Монтаж профилированного настила",
    "единица_измерения_работы": "м2",
    "цена_0_300": 400,
    "цена_300_600": 400,
    "цена_600_1000": 300,
    "цена_1000_3000": 300,
    "цена_3000_6000": 250,
    "цена_6000_15000": 230,
    "цена_15000_30000": 200,
    "цена_более_30000": 180
  },
  {
    "категория_работы": "Основание",
    "наименование_работы": "Устройство L-образного профиля и профилей усиления (коньковые усиления, усиления ендов, усиления деф. шва)",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 160,
    "цена_300_600": 160,
    "цена_600_1000": 160,
    "цена_1000_3000": 160,
    "цена_3000_6000": 160,
    "цена_6000_15000": 160,
    "цена_15000_30000": 160,
    "цена_более_30000": 160
  },
  {
    "категория_работы": "Основание",
    "наименование_работы": "Монтаж шины молниезащиты",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 240,
    "цена_300_600": 240,
    "цена_600_1000": 240,
    "цена_1000_3000": 240,
    "цена_3000_6000": 240,
    "цена_6000_15000": 240,
    "цена_15000_30000": 240,
    "цена_более_30000": 240
  },
  {
    "категория_работы": "Основание",
    "наименование_работы": "Устройство усиления мест воронок внутреннего водоотведения из оц. стали толщиной 0,7 мм",
    "единица_измерения_работы": "м2",
    "цена_0_300": 400,
    "цена_300_600": 400,
    "цена_600_1000": 400,
    "цена_1000_3000": 400,
    "цена_3000_6000": 400,
    "цена_6000_15000": 400,
    "цена_15000_30000": 400,
    "цена_более_30000": 400
  },
  {
    "категория_работы": "Основание",
    "наименование_работы": "Устройство заполнения гофр профлиста НГ утеплителем на длину 250 мм (на две продольной волны или 250 мм в каждую волну по поперечным волнам)",
    "единица_измерения_работы": "мп",
    "цена_0_300": 120,
    "цена_300_600": 120,
    "цена_600_1000": 120,
    "цена_1000_3000": 120,
    "цена_3000_6000": 120,
    "цена_6000_15000": 120,
    "цена_15000_30000": 120,
    "цена_более_30000": 120
  },
  {
    "категория_работы": "Основание",
    "наименование_работы": "Устройство бортика (галтель)",
    "единица_измерения_работы": "мп",
    "цена_0_300": 250,
    "цена_300_600": 250,
    "цена_600_1000": 250,
    "цена_1000_3000": 230,
    "цена_3000_6000": 200,
    "цена_6000_15000": 180,
    "цена_15000_30000": 150,
    "цена_более_30000": 120
  },
  {
    "категория_работы": "Основание",
    "наименование_работы": "Праймирование поверхности",
    "единица_измерения_работы": "м2",
    "цена_0_300": 120,
    "цена_300_600": 120,
    "цена_600_1000": 100,
    "цена_1000_3000": 100,
    "цена_3000_6000": 90,
    "цена_6000_15000": 80,
    "цена_15000_30000": 60,
    "цена_более_30000": 50
  },
  {
    "категория_работы": "Пароизоляция",
    "наименование_работы": "Устройство пароизоляционного слоя из пленки",
    "единица_измерения_работы": "м2",
    "цена_0_300": 120,
    "цена_300_600": 120,
    "цена_600_1000": 110,
    "цена_1000_3000": 100,
    "цена_3000_6000": 80,
    "цена_6000_15000": 60,
    "цена_15000_30000": 40,
    "цена_более_30000": 50
  },
  {
    "категория_работы": "Пароизоляция",
    "наименование_работы": "Устройство пароизоляционного слоя из Паробарьера",
    "единица_измерения_работы": "м2",
    "цена_0_300": 150,
    "цена_300_600": 150,
    "цена_600_1000": 130,
    "цена_1000_3000": 130,
    "цена_3000_6000": 110,
    "цена_6000_15000": 90,
    "цена_15000_30000": 80,
    "цена_более_30000": 56
  },
  {
    "категория_работы": "Пароизоляция",
    "наименование_работы": "Устройство пароизоляционного слоя из битумных наплавляющих материалов (СПЛОШНОЕ НАПЛАВЛЕНИЕ)",
    "единица_измерения_работы": "м2",
    "цена_0_300": 250,
    "цена_300_600": 240,
    "цена_600_1000": 220,
    "цена_1000_3000": 180,
    "цена_3000_6000": 150,
    "цена_6000_15000": 150,
    "цена_15000_30000": 120,
    "цена_более_30000": 120
  },
  {
    "категория_работы": "Пароизоляция",
    "наименование_работы": "Устройство пароизоляционного слоя из битумных наплавляющих материалов (НАПЛАВЛЕНИЕ ПО ШВАМ)",
    "единица_измерения_работы": "м2",
    "цена_0_300": 215,
    "цена_300_600": 205,
    "цена_600_1000": 190,
    "цена_1000_3000": 150,
    "цена_3000_6000": 130,
    "цена_6000_15000": 130,
    "цена_15000_30000": 100,
    "цена_более_30000": 100
  },
  {
    "категория_работы": "Контруклон и теплоизоляция",
    "наименование_работы": "Устройство контруклона из минераловатных теплоизоляционных плит",
    "единица_измерения_работы": "м2",
    "цена_0_300": 500,
    "цена_300_600": 500,
    "цена_600_1000": 400,
    "цена_1000_3000": 380,
    "цена_3000_6000": 380,
    "цена_6000_15000": 340,
    "цена_15000_30000": 320,
    "цена_более_30000": 280
  },
  {
    "категория_работы": "Контруклон и теплоизоляция",
    "наименование_работы": "Устройство контруклона из полимерных теплоизоляционных плит",
    "единица_измерения_работы": "м2",
    "цена_0_300": 400,
    "цена_300_600": 400,
    "цена_600_1000": 320,
    "цена_1000_3000": 310,
    "цена_3000_6000": 300,
    "цена_6000_15000": 270,
    "цена_15000_30000": 255,
    "цена_более_30000": 225
  },
  {
    "категория_работы": "Контруклон и теплоизоляция",
    "наименование_работы": "Устройство теплоизоляционного слоя из ПИР/ХПС за один слой без мех. Крепления",
    "единица_измерения_работы": "м2",
    "цена_0_300": 180,
    "цена_300_600": 180,
    "цена_600_1000": 140,
    "цена_1000_3000": 140,
    "цена_3000_6000": 140,
    "цена_6000_15000": 140,
    "цена_15000_30000": 140,
    "цена_более_30000": 140
  },
  {
    "категория_работы": "Контруклон и теплоизоляция",
    "наименование_работы": "Устройство теплоизоляционного слоя из минераловатного утеплителя в один слой с разбежкой швов между рядами без мех.крепления",
    "единица_измерения_работы": "м2",
    "цена_0_300": 200,
    "цена_300_600": 200,
    "цена_600_1000": 160,
    "цена_1000_3000": 160,
    "цена_3000_6000": 160,
    "цена_6000_15000": 160,
    "цена_15000_30000": 160,
    "цена_более_30000": 160
  },
  {
    "категория_работы": "Разделительный слой",
    "наименование_работы": "Устройство разделительного слоя из стеклохолста/геотекстиля",
    "единица_измерения_работы": "м2",
    "цена_0_300": 100,
    "цена_300_600": 100,
    "цена_600_1000": 100,
    "цена_1000_3000": 80,
    "цена_3000_6000": 80,
    "цена_6000_15000": 60,
    "цена_15000_30000": 40,
    "цена_более_30000": 40
  },
  {
    "категория_работы": "Гидроизоляция",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны шириной 2 м (центральная зона), с продольным нахлестом не менее 120 мм и поперечным не менее 200 мм по профлисту",
    "единица_измерения_работы": "м2",
    "цена_0_300": 385,
    "цена_300_600": 385,
    "цена_600_1000": 385,
    "цена_1000_3000": 350,
    "цена_3000_6000": 320,
    "цена_6000_15000": 310,
    "цена_15000_30000": 270,
    "цена_более_30000": 260
  },
  {
    "категория_работы": "Гидроизоляция",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны шириной 0.5-1 м (парапетная зона), с продольным нахлестом не менее 120 мм и поперечным не менее 200 мм по профлисту",
    "единица_измерения_работы": "м2",
    "цена_0_300": 480,
    "цена_300_600": 480,
    "цена_600_1000": 480,
    "цена_1000_3000": 440,
    "цена_3000_6000": 400,
    "цена_6000_15000": 384,
    "цена_15000_30000": 336,
    "цена_более_30000": 320
  },
  {
    "категория_работы": "Гидроизоляция",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны шириной 2 м (центральная зона), с продольным нахлестом не менее 120 мм и поперечным не менее 200 мм по ж/б",
    "единица_измерения_работы": "м2",
    "цена_0_300": 480,
    "цена_300_600": 480,
    "цена_600_1000": 480,
    "цена_1000_3000": 440,
    "цена_3000_6000": 400,
    "цена_6000_15000": 384,
    "цена_15000_30000": 336,
    "цена_более_30000": 320
  },
  {
    "категория_работы": "Гидроизоляция",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны шириной 0.5-1 м (парапетная зона), с продольным нахлестом не менее 120 мм и поперечным не менее 200 мм по ж/б",
    "единица_измерения_работы": "м2",
    "цена_0_300": 600,
    "цена_300_600": 600,
    "цена_600_1000": 600,
    "цена_1000_3000": 550,
    "цена_3000_6000": 500,
    "цена_6000_15000": 480,
    "цена_15000_30000": 420,
    "цена_более_30000": 400
  },
  {
    "категория_работы": "Гидроизоляция",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из полимеро-битумного наплавляемого материала в 2 слоя",
    "единица_измерения_работы": "м2",
    "цена_0_300": 520,
    "цена_300_600": 500,
    "цена_600_1000": 460,
    "цена_1000_3000": 400,
    "цена_3000_6000": 380,
    "цена_6000_15000": 360,
    "цена_15000_30000": 320,
    "цена_более_30000": 260
  },
  {
    "категория_работы": "Гидроизоляция",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из БРМ в один слой с мех креплением по профлисту",
    "единица_измерения_работы": "м2",
    "цена_0_300": 385,
    "цена_300_600": 385,
    "цена_600_1000": 385,
    "цена_1000_3000": 350,
    "цена_3000_6000": 320,
    "цена_6000_15000": 310,
    "цена_15000_30000": 270,
    "цена_более_30000": 260
  },
  {
    "категория_работы": "Гидроизоляция",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из БРМ в один слой с мех креплением по ж/б",
    "единица_измерения_работы": "м2",
    "цена_0_300": 480,
    "цена_300_600": 480,
    "цена_600_1000": 480,
    "цена_1000_3000": 440,
    "цена_3000_6000": 400,
    "цена_6000_15000": 384,
    "цена_15000_30000": 336,
    "цена_более_30000": 320
  },
  {
    "категория_работы": "Гидроизоляция",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из БРМ в один слой",
    "единица_измерения_работы": "м2",
    "цена_0_300": 260,
    "цена_300_600": 250,
    "цена_600_1000": 230,
    "цена_1000_3000": 200,
    "цена_3000_6000": 190,
    "цена_6000_15000": 180,
    "цена_15000_30000": 160,
    "цена_более_30000": 130
  },
  {
    "категория_работы": "Мех. Крепление",
    "наименование_работы": "Механическое крепление по профлисту",
    "единица_измерения_работы": "м2",
    "цена_0_300": 110,
    "цена_300_600": 110,
    "цена_600_1000": 95,
    "цена_1000_3000": 90,
    "цена_3000_6000": 75,
    "цена_6000_15000": 75,
    "цена_15000_30000": 60,
    "цена_более_30000": 45
  },
  {
    "категория_работы": "Мех. Крепление",
    "наименование_работы": "Механическое крепление по ж/б",
    "единица_измерения_работы": "м2",
    "цена_0_300": 150,
    "цена_300_600": 150,
    "цена_600_1000": 130,
    "цена_1000_3000": 120,
    "цена_3000_6000": 100,
    "цена_6000_15000": 100,
    "цена_15000_30000": 80,
    "цена_более_30000": 60
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Утройство утепления парапета на высоту 500 мм",
    "единица_измерения_работы": "мп",
    "цена_0_300": 600,
    "цена_300_600": 600,
    "цена_600_1000": 500,
    "цена_1000_3000": 400,
    "цена_3000_6000": 400,
    "цена_6000_15000": 350,
    "цена_15000_30000": 320,
    "цена_более_30000": 300
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Устройство примыкания гидроизоляционного покрытия из ПВХ мембраны к парапету на высоту до 500 мм по сендвичу",
    "единица_измерения_работы": "мп",
    "цена_0_300": 750,
    "цена_300_600": 730,
    "цена_600_1000": 670,
    "цена_1000_3000": 580,
    "цена_3000_6000": 500,
    "цена_6000_15000": 430,
    "цена_15000_30000": 375,
    "цена_более_30000": 360
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Устройство примыкания гидроизоляционного покрытия из ПВХ мембраны к парапету, с заведением ПВХ мембраны за парапет, с высотой заведения более 450 мм (с промежуточным креплением) по сендвичу",
    "единица_измерения_работы": "мп",
    "цена_0_300": 850,
    "цена_300_600": 850,
    "цена_600_1000": 780,
    "цена_1000_3000": 680,
    "цена_3000_6000": 580,
    "цена_6000_15000": 500,
    "цена_15000_30000": 440,
    "цена_более_30000": 420
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Устройство примыкания гидроизоляционного покрытия из ПВХ мембраны к парапету на высоту до 500 мм по ж/б",
    "единица_измерения_работы": "мп",
    "цена_0_300": 780,
    "цена_300_600": 770,
    "цена_600_1000": 710,
    "цена_1000_3000": 620,
    "цена_3000_6000": 540,
    "цена_6000_15000": 470,
    "цена_15000_30000": 420,
    "цена_более_30000": 400
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Устройство примыкания гидроизоляционного покрытия из ПВХ мембраны к парапету, с заведением ПВХ мембраны за парапет, с высотой заведения более 450 мм (с промежуточным креплением) по ж/б",
    "единица_измерения_работы": "мп",
    "цена_0_300": 900,
    "цена_300_600": 900,
    "цена_600_1000": 830,
    "цена_1000_3000": 730,
    "цена_3000_6000": 630,
    "цена_6000_15000": 550,
    "цена_15000_30000": 490,
    "цена_более_30000": 470
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Монтаж гидроизоляции к стенам, вент. проходам и выходу на кровлю высотой до 500 мм из полимеро-битумного наплавляемого материала в два слоя",
    "единица_измерения_работы": "мп",
    "цена_0_300": 700,
    "цена_300_600": 700,
    "цена_600_1000": 600,
    "цена_1000_3000": 500,
    "цена_3000_6000": 400,
    "цена_6000_15000": 360,
    "цена_15000_30000": 320,
    "цена_более_30000": 320
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Монтаж бруса для карнизного свеса",
    "единица_измерения_работы": "мп",
    "цена_0_300": 700,
    "цена_300_600": 700,
    "цена_600_1000": 700,
    "цена_1000_3000": 600,
    "цена_3000_6000": 600,
    "цена_6000_15000": 500,
    "цена_15000_30000": 500,
    "цена_более_30000": 500
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Монтаж ламинированного металла",
    "единица_измерения_работы": "мп",
    "цена_0_300": 270,
    "цена_300_600": 250,
    "цена_600_1000": 220,
    "цена_1000_3000": 200,
    "цена_3000_6000": 200,
    "цена_6000_15000": 180,
    "цена_15000_30000": 170,
    "цена_более_30000": 160
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Монтаж металлического водосточного желоба",
    "единица_измерения_работы": "мп",
    "цена_0_300": 240,
    "цена_300_600": 225,
    "цена_600_1000": 200,
    "цена_1000_3000": 180,
    "цена_3000_6000": 180,
    "цена_6000_15000": 160,
    "цена_15000_30000": 150,
    "цена_более_30000": 145
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Устройство примыкания к карнизному свесу через капельник",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 800,
    "цена_300_600": 800,
    "цена_600_1000": 800,
    "цена_1000_3000": 600,
    "цена_3000_6000": 600,
    "цена_6000_15000": 600,
    "цена_15000_30000": 600,
    "цена_более_30000": 400
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Монтаж прижимной и краевой кровельной планки по сендвичу",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 120,
    "цена_300_600": 120,
    "цена_600_1000": 120,
    "цена_1000_3000": 80,
    "цена_3000_6000": 80,
    "цена_6000_15000": 80,
    "цена_15000_30000": 80,
    "цена_более_30000": 60
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Монтаж прижимной и краевой кровельной планки по ж/б",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 150,
    "цена_300_600": 150,
    "цена_600_1000": 150,
    "цена_1000_3000": 100,
    "цена_3000_6000": 100,
    "цена_6000_15000": 100,
    "цена_15000_30000": 80,
    "цена_более_30000": 80
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Устройство парапетных крышек в нахлест с мех. Креплением по сендвичу",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 500,
    "цена_300_600": 500,
    "цена_600_1000": 500,
    "цена_1000_3000": 500,
    "цена_3000_6000": 500,
    "цена_6000_15000": 500,
    "цена_15000_30000": 500,
    "цена_более_30000": 500
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Устройство парапетных крышек в нахлест с мех крепением по ж/б",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 800,
    "цена_300_600": 800,
    "цена_600_1000": 800,
    "цена_1000_3000": 800,
    "цена_3000_6000": 800,
    "цена_6000_15000": 800,
    "цена_15000_30000": 800,
    "цена_более_30000": 800
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Утепление и гидроизоляция из ПВХ мембраны стоек-фахверка",
    "единица_измерения_работы": "шт",
    "цена_0_300": 3500,
    "цена_300_600": 3500,
    "цена_600_1000": 3500,
    "цена_1000_3000": 2800,
    "цена_3000_6000": 2800,
    "цена_6000_15000": 2800,
    "цена_15000_30000": 2800,
    "цена_более_30000": 2800
  },
  {
    "категория_работы": "Парапет",
    "наименование_работы": "Утепление и гидроизоляция из БРМ стоек-фахверка в два слоя",
    "единица_измерения_работы": "шт",
    "цена_0_300": 4200,
    "цена_300_600": 4200,
    "цена_600_1000": 4200,
    "цена_1000_3000": 3360,
    "цена_3000_6000": 3360,
    "цена_6000_15000": 3360,
    "цена_15000_30000": 3360,
    "цена_более_30000": 3360
  },
  {
    "категория_работы": "Проходки через кровлю",
    "наименование_работы": "Устройство примыкания к дефлекторам круглого сечения из ПВХ-мембраны с утеплением",
    "единица_измерения_работы": "шт",
    "цена_0_300": 3900,
    "цена_300_600": 3900,
    "цена_600_1000": 3900,
    "цена_1000_3000": 3400,
    "цена_3000_6000": 3400,
    "цена_6000_15000": 3400,
    "цена_15000_30000": 3200,
    "цена_более_30000": 2800
  },
  {
    "категория_работы": "Проходки через кровлю",
    "наименование_работы": "Устройство примыкания к зенитным фонарям и люкам дымоудаления из ПВХ-мембраны",
    "единица_измерения_работы": "шт",
    "цена_0_300": 4500,
    "цена_300_600": 4500,
    "цена_600_1000": 4500,
    "цена_1000_3000": 3600,
    "цена_3000_6000": 3600,
    "цена_6000_15000": 3600,
    "цена_15000_30000": 3600,
    "цена_более_30000": 3600
  },
  {
    "категория_работы": "Проходки через кровлю",
    "наименование_работы": "Устройство примыкания к опорам технологического оборудования из ПВХ-мембраны",
    "единица_измерения_работы": "шт",
    "цена_0_300": 3000,
    "цена_300_600": 3000,
    "цена_600_1000": 3000,
    "цена_1000_3000": 2600,
    "цена_3000_6000": 2600,
    "цена_6000_15000": 2600,
    "цена_15000_30000": 2400,
    "цена_более_30000": 2000
  },
  {
    "категория_работы": "Проходки через кровлю",
    "наименование_работы": "Устройство примыкания из ПВХ-мембраны к проходккам через кровлю d=10-300 мм",
    "единица_измерения_работы": "шт",
    "цена_0_300": 3000,
    "цена_300_600": 3000,
    "цена_600_1000": 3000,
    "цена_1000_3000": 2600,
    "цена_3000_6000": 2600,
    "цена_6000_15000": 2600,
    "цена_15000_30000": 2400,
    "цена_более_30000": 2000
  },
  {
    "категория_работы": "Проходки через кровлю",
    "наименование_работы": "Устройство примыкания из ПВХ-мембраны к проходккам через кровлю d=300-500 мм",
    "единица_измерения_работы": "шт",
    "цена_0_300": 3200,
    "цена_300_600": 3200,
    "цена_600_1000": 3200,
    "цена_1000_3000": 2800,
    "цена_3000_6000": 2800,
    "цена_6000_15000": 2800,
    "цена_15000_30000": 2600,
    "цена_более_30000": 2200
  },
  {
    "категория_работы": "Проходки через кровлю",
    "наименование_работы": "Устройство примыкания из ПВХ-мембраны к проходккам через кровлю d=500-1500 мм",
    "единица_измерения_работы": "шт",
    "цена_0_300": 3500,
    "цена_300_600": 3500,
    "цена_600_1000": 3500,
    "цена_1000_3000": 3000,
    "цена_3000_6000": 3000,
    "цена_6000_15000": 3000,
    "цена_15000_30000": 2800,
    "цена_более_30000": 2400
  },
  {
    "категория_работы": "Проходки через кровлю",
    "наименование_работы": "Устройство утепления примыкания к опорам технологического оборудования (в том числе проходки малых диаметров)",
    "единица_измерения_работы": "шт",
    "цена_0_300": 600,
    "цена_300_600": 500,
    "цена_600_1000": 500,
    "цена_1000_3000": 500,
    "цена_3000_6000": 500,
    "цена_6000_15000": 500,
    "цена_15000_30000": 500,
    "цена_более_30000": 400
  },
  {
    "категория_работы": "Проходки через кровлю",
    "наименование_работы": "Устройство примыканий к гусакам из ПВХ-мембраны",
    "единица_измерения_работы": "шт",
    "цена_0_300": 3000,
    "цена_300_600": 3000,
    "цена_600_1000": 3000,
    "цена_1000_3000": 2000,
    "цена_3000_6000": 3000,
    "цена_6000_15000": 3000,
    "цена_15000_30000": 3000,
    "цена_более_30000": 3000
  },
  {
    "категория_работы": "Проходки через кровлю",
    "наименование_работы": "Устройство примыканий из ПВХ мембрраны к выступающим конструкциям (мп) под краевую рейку",
    "единица_измерения_работы": "мп",
    "цена_0_300": 1000,
    "цена_300_600": 580,
    "цена_600_1000": 1000,
    "цена_1000_3000": 1000,
    "цена_3000_6000": 1000,
    "цена_6000_15000": 1000,
    "цена_15000_30000": 300,
    "цена_более_30000": 300
  },
  {
    "категория_работы": "Проходки через кровлю",
    "наименование_работы": "Устройство примыканий из БРМ мембрраны к выступающим конструкциям (мп) в два слоя",
    "единица_измерения_работы": "мп",
    "цена_0_300": 700,
    "цена_300_600": 700,
    "цена_600_1000": 600,
    "цена_1000_3000": 500,
    "цена_3000_6000": 400,
    "цена_6000_15000": 360,
    "цена_15000_30000": 320,
    "цена_более_30000": 320
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Устройство деф.шва из ПВХ-мембраны",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 500,
    "цена_300_600": 500,
    "цена_600_1000": 500,
    "цена_1000_3000": 500,
    "цена_3000_6000": 500,
    "цена_6000_15000": 500,
    "цена_15000_30000": 300,
    "цена_более_30000": 300
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Монтаж гидроизоляции деформационного шва до 500 мм из полимеро-битумного наплавляемого материала в два слоя.",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 1000,
    "цена_300_600": 1000,
    "цена_600_1000": 1000,
    "цена_1000_3000": 1000,
    "цена_3000_6000": 1000,
    "цена_6000_15000": 1000,
    "цена_15000_30000": 1000,
    "цена_более_30000": 1000
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Устройство противопожарных рассечек 3*3 м вокруг зенитных фонарей, люков дымоудаления и дефлекторов из материала Logicroof NG",
    "единица_измерения_работы": "м2",
    "цена_0_300": 400,
    "цена_300_600": 400,
    "цена_600_1000": 400,
    "цена_1000_3000": 400,
    "цена_3000_6000": 400,
    "цена_6000_15000": 400,
    "цена_15000_30000": 400,
    "цена_более_30000": 400
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Устройство кровельных аэраторов",
    "единица_измерения_работы": "шт",
    "цена_0_300": 1600,
    "цена_300_600": 1600,
    "цена_600_1000": 1600,
    "цена_1000_3000": 1600,
    "цена_3000_6000": 1600,
    "цена_6000_15000": 1600,
    "цена_15000_30000": 1600,
    "цена_более_30000": 1600
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Устройство кровельных аэраторов с закреплением к основанию, верезкой пирога до пароизоляции и заполнением аэратора керамзитом",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2200,
    "цена_300_600": 2200,
    "цена_600_1000": 2200,
    "цена_1000_3000": 2200,
    "цена_3000_6000": 2200,
    "цена_6000_15000": 2200,
    "цена_15000_30000": 2200,
    "цена_более_30000": 2200
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Вырез профлиста/парапета из сендвич-панели под водоприемную воронку",
    "единица_измерения_работы": "шт",
    "цена_0_300": 700,
    "цена_300_600": 700,
    "цена_600_1000": 700,
    "цена_1000_3000": 700,
    "цена_3000_6000": 700,
    "цена_6000_15000": 700,
    "цена_15000_30000": 700,
    "цена_более_30000": 700
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Вырез основания/парапета из бетона под водоприемную воронку (алмазное бурение)",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2000,
    "цена_300_600": 2000,
    "цена_600_1000": 2000,
    "цена_1000_3000": 2000,
    "цена_3000_6000": 2000,
    "цена_6000_15000": 2000,
    "цена_15000_30000": 2000,
    "цена_более_30000": 2000
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Монтаж воронок",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2000,
    "цена_300_600": 2000,
    "цена_600_1000": 2000,
    "цена_1000_3000": 2000,
    "цена_3000_6000": 2000,
    "цена_6000_15000": 2000,
    "цена_15000_30000": 2000,
    "цена_более_30000": 2000
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Монтаж люков дымоудаления",
    "единица_измерения_работы": "шт",
    "цена_0_300": 4000,
    "цена_300_600": 4000,
    "цена_600_1000": 4000,
    "цена_1000_3000": 4000,
    "цена_3000_6000": 4000,
    "цена_6000_15000": 4000,
    "цена_15000_30000": 4000,
    "цена_более_30000": 4000
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Монтаж дефлекторов (без примыкания)",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2800,
    "цена_300_600": 2800,
    "цена_600_1000": 2800,
    "цена_1000_3000": 2800,
    "цена_3000_6000": 2800,
    "цена_6000_15000": 2800,
    "цена_15000_30000": 2800,
    "цена_более_30000": 2800
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Монтаж пешеходных дорожек из пазлов, 600*600 мм",
    "единица_измерения_работы": "мп",
    "цена_0_300": 450,
    "цена_300_600": 450,
    "цена_600_1000": 450,
    "цена_1000_3000": 450,
    "цена_3000_6000": 450,
    "цена_6000_15000": 450,
    "цена_15000_30000": 450,
    "цена_более_30000": 450
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Монтаж классических пешеходных дорожек (фанера/геотекстиль/мембрана)",
    "единица_измерения_работы": "мп",
    "цена_0_300": 450,
    "цена_300_600": 450,
    "цена_600_1000": 450,
    "цена_1000_3000": 450,
    "цена_3000_6000": 450,
    "цена_6000_15000": 450,
    "цена_15000_30000": 450,
    "цена_более_30000": 450
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Монтаж системы мониторинга снеговой нагрузки (2 датчика/приемное устройство/кабеля)",
    "единица_измерения_работы": "компл",
    "цена_0_300": 150000,
    "цена_300_600": 150000,
    "цена_600_1000": 150000,
    "цена_1000_3000": 150000,
    "цена_3000_6000": 150000,
    "цена_6000_15000": 150000,
    "цена_15000_30000": 150000,
    "цена_более_30000": 150000
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны, с шириной рулона 2 м, с продольным нахлестом не менее 80мм и поперечным 200мм по плоскости",
    "единица_измерения_работы": "м2",
    "цена_0_300": 0,
    "цена_300_600": 0,
    "цена_600_1000": 0,
    "цена_1000_3000": 0,
    "цена_3000_6000": 0,
    "цена_6000_15000": 900,
    "цена_15000_30000": 900,
    "цена_более_30000": 0
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Устройство примыканий (Монтаж компенсатора из велотерма)",
    "единица_измерения_работы": "мп",
    "цена_0_300": 0,
    "цена_300_600": 0,
    "цена_600_1000": 0,
    "цена_1000_3000": 0,
    "цена_3000_6000": 0,
    "цена_6000_15000": 100,
    "цена_15000_30000": 100,
    "цена_более_30000": 0
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Устройство примыканий (Монтаж компенсационной петли из ПВХ мембраны)",
    "единица_измерения_работы": "мп",
    "цена_0_300": 0,
    "цена_300_600": 0,
    "цена_600_1000": 0,
    "цена_1000_3000": 0,
    "цена_3000_6000": 0,
    "цена_6000_15000": 400,
    "цена_15000_30000": 400,
    "цена_более_30000": 0
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Устройство примыканий (Монтаж примыкания из ПВХ мембраны)",
    "единица_измерения_работы": "мп",
    "цена_0_300": 0,
    "цена_300_600": 0,
    "цена_600_1000": 0,
    "цена_1000_3000": 0,
    "цена_3000_6000": 0,
    "цена_6000_15000": 500,
    "цена_15000_30000": 500,
    "цена_более_30000": 0
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Устройство примыканий (Монтаж краевой рейки с заполнением п/у герметиком)",
    "единица_измерения_работы": "мп",
    "цена_0_300": 0,
    "цена_300_600": 0,
    "цена_600_1000": 0,
    "цена_1000_3000": 0,
    "цена_3000_6000": 0,
    "цена_6000_15000": 200,
    "цена_15000_30000": 200,
    "цена_более_30000": 0
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Монтаж двухуровневых воронок",
    "единица_измерения_работы": "шт",
    "цена_0_300": 0,
    "цена_300_600": 0,
    "цена_600_1000": 0,
    "цена_1000_3000": 0,
    "цена_3000_6000": 0,
    "цена_6000_15000": 10000,
    "цена_15000_30000": 10000,
    "цена_более_30000": 0
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Устройство примыкания к трубным проходкам",
    "единица_измерения_работы": "шт",
    "цена_0_300": 0,
    "цена_300_600": 0,
    "цена_600_1000": 0,
    "цена_1000_3000": 0,
    "цена_3000_6000": 0,
    "цена_6000_15000": 15000,
    "цена_15000_30000": 15000,
    "цена_более_30000": 0
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Устройство примыканий к деф. шву",
    "единица_измерения_работы": "мп",
    "цена_0_300": 600,
    "цена_300_600": 600,
    "цена_600_1000": 600,
    "цена_1000_3000": 600,
    "цена_3000_6000": 600,
    "цена_6000_15000": 2000,
    "цена_15000_30000": 2000,
    "цена_более_30000": 600
  },
  {
    "категория_работы": "Доп",
    "наименование_работы": "Монтаж кровельного ограждения (без гидроизоляции)",
    "единица_измерения_работы": "мп",
    "цена_0_300": 600,
    "цена_300_600": 600,
    "цена_600_1000": 600,
    "цена_1000_3000": 600,
    "цена_3000_6000": 600,
    "цена_6000_15000": 600,
    "цена_15000_30000": 600,
    "цена_более_30000": 600
  },
  {
    "категория_работы": "Накладные расходы",
    "наименование_работы": "Вывоз мусора",
    "единица_измерения_работы": "рейс",
    "цена_0_300": 12800,
    "цена_300_600": 12800,
    "цена_600_1000": 12800,
    "цена_1000_3000": 12800,
    "цена_3000_6000": 12800,
    "цена_6000_15000": 12800,
    "цена_15000_30000": 12800,
    "цена_более_30000": 12800
  },
  {
    "категория_работы": "Накладные расходы",
    "наименование_работы": "Кран",
    "единица_измерения_работы": "Смена 8 ч",
    "цена_0_300": 44000,
    "цена_300_600": 44000,
    "цена_600_1000": 44000,
    "цена_1000_3000": 44000,
    "цена_3000_6000": 44000,
    "цена_6000_15000": 44000,
    "цена_15000_30000": 44000,
    "цена_более_30000": 44000
  },
  {
    "категория_работы": "Накладные расходы",
    "наименование_работы": "Манипулятор",
    "единица_измерения_работы": "Смена 8 ч",
    "цена_0_300": 28000,
    "цена_300_600": 28000,
    "цена_600_1000": 28000,
    "цена_1000_3000": 28000,
    "цена_3000_6000": 28000,
    "цена_6000_15000": 28000,
    "цена_15000_30000": 28000,
    "цена_более_30000": 28000
  },
  {
    "категория_работы": "Демонтажные работы в осях 36-47/П-Э",
    "наименование_работы": "Демонтаж гидроизоляционного слоя",
    "единица_измерения_работы": "м2",
    "цена_0_300": 80,
    "цена_300_600": 80,
    "цена_600_1000": 80,
    "цена_1000_3000": 80,
    "цена_3000_6000": 80,
    "цена_6000_15000": 80,
    "цена_15000_30000": 80,
    "цена_более_30000": 80
  },
  {
    "категория_работы": "Демонтажные работы в осях 36-47/П-Э",
    "наименование_работы": "Демонтаж теплоизоляционного слоя",
    "единица_измерения_работы": "м2",
    "цена_0_300": 100,
    "цена_300_600": 100,
    "цена_600_1000": 100,
    "цена_1000_3000": 100,
    "цена_3000_6000": 100,
    "цена_6000_15000": 100,
    "цена_15000_30000": 100,
    "цена_более_30000": 100
  },
  {
    "категория_работы": "Монтаж профилированного настила",
    "наименование_работы": "Монтаж профилированного настила Н-114",
    "единица_измерения_работы": "м2",
    "цена_0_300": 140,
    "цена_300_600": 140,
    "цена_600_1000": 140,
    "цена_1000_3000": 140,
    "цена_3000_6000": 140,
    "цена_6000_15000": 140,
    "цена_15000_30000": 140,
    "цена_более_30000": 140
  },
  {
    "категория_работы": "Устройство L-образного профиля в местах парапета и профилей усиления в ендове и на коньках, устройство профиля усиления деф. швов",
    "наименование_работы": "Устройство L-образного профиля и профилей усиления",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 130,
    "цена_300_600": 130,
    "цена_600_1000": 130,
    "цена_1000_3000": 130,
    "цена_3000_6000": 130,
    "цена_6000_15000": 130,
    "цена_15000_30000": 130,
    "цена_более_30000": 130
  },
  {
    "категория_работы": "Устройство L-образного профиля в местах парапета и профилей усиления в ендове и на коньках, устройство профиля усиления деф. швов",
    "наименование_работы": "Устройство профилей усиления (коньковые усиления, усиления ендов)",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 85,
    "цена_300_600": 85,
    "цена_600_1000": 85,
    "цена_1000_3000": 85,
    "цена_3000_6000": 85,
    "цена_6000_15000": 85,
    "цена_15000_30000": 85,
    "цена_более_30000": 85
  },
  {
    "категория_работы": "Устройство L-образного профиля в местах парапета и профилей усиления в ендове и на коньках, устройство профиля усиления деф. швов",
    "наименование_работы": "Устройство профилей усиления деф. шва",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 85,
    "цена_300_600": 85,
    "цена_600_1000": 85,
    "цена_1000_3000": 85,
    "цена_3000_6000": 85,
    "цена_6000_15000": 85,
    "цена_15000_30000": 85,
    "цена_более_30000": 85
  },
  {
    "категория_работы": "Устройство шины молниезащиты/ заземления",
    "наименование_работы": "Монтаж шины молниезащиты (механическое крепление)",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 200,
    "цена_300_600": 200,
    "цена_600_1000": 200,
    "цена_1000_3000": 200,
    "цена_3000_6000": 200,
    "цена_6000_15000": 200,
    "цена_15000_30000": 200,
    "цена_более_30000": 200
  },
  {
    "категория_работы": "Устройство усиления мест воронок внутреннего водоотведения",
    "наименование_работы": "Устройство усиления мест воронок внутреннего водоотведения из оц. стали толщиной 0,5 мм размером 0,6*0,6 м",
    "единица_измерения_работы": "шт",
    "цена_0_300": 100,
    "цена_300_600": 100,
    "цена_600_1000": 100,
    "цена_1000_3000": 100,
    "цена_3000_6000": 100,
    "цена_6000_15000": 100,
    "цена_15000_30000": 100,
    "цена_более_30000": 100
  },
  {
    "категория_работы": "Устройство заполнения гофр профлиста НГ утеплителем на длину 250 мм",
    "наименование_работы": "Устройство заполнения гофр профлиста НГ утеплителем на длину 250 мм",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 180,
    "цена_300_600": 180,
    "цена_600_1000": 180,
    "цена_1000_3000": 180,
    "цена_3000_6000": 180,
    "цена_6000_15000": 180,
    "цена_15000_30000": 180,
    "цена_более_30000": 180
  },
  {
    "категория_работы": "Устройство пароизоляционного слоя",
    "наименование_работы": "Устройство пароизоляционного слоя из пароизоляционной пленки",
    "единица_измерения_работы": "м2",
    "цена_0_300": 60,
    "цена_300_600": 60,
    "цена_600_1000": 60,
    "цена_1000_3000": 60,
    "цена_3000_6000": 60,
    "цена_6000_15000": 60,
    "цена_15000_30000": 60,
    "цена_более_30000": 60
  },
  {
    "категория_работы": "Устройство контруклона в ендовах из минераловатных теплоизоляционных плит 4,2 %",
    "наименование_работы": "Устройство контруклона из минераловатных теплоизоляционных плит 4,2 %",
    "единица_измерения_работы": "м2",
    "цена_0_300": 170,
    "цена_300_600": 170,
    "цена_600_1000": 170,
    "цена_1000_3000": 170,
    "цена_3000_6000": 170,
    "цена_6000_15000": 170,
    "цена_15000_30000": 170,
    "цена_более_30000": 170
  },
  {
    "категория_работы": "Устройство теплоизоляционного слоя из минераловатного утеплителя в два слоя с перехлестом швов",
    "наименование_работы": "Устройство теплоизоляционного слоя из минераловатного утеплителя в два слоя с перехлестом швов с мех. креплением",
    "единица_измерения_работы": "м2",
    "цена_0_300": 165,
    "цена_300_600": 165,
    "цена_600_1000": 165,
    "цена_1000_3000": 165,
    "цена_3000_6000": 165,
    "цена_6000_15000": 165,
    "цена_15000_30000": 165,
    "цена_более_30000": 165
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости с учетом ветровых зон",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны, с продольным нахлестом не менее 120 мм и поперечным - не менее 200 мм",
    "единица_измерения_работы": "м2",
    "цена_0_300": 190,
    "цена_300_600": 190,
    "цена_600_1000": 190,
    "цена_1000_3000": 190,
    "цена_3000_6000": 190,
    "цена_6000_15000": 190,
    "цена_15000_30000": 190,
    "цена_более_30000": 190
  },
  {
    "категория_работы": "Устройство гидроизоляции примыканий к парапету из ПВХ-мембраны",
    "наименование_работы": "Устройство примыкания гидроизоляционного покрытия из ПВХ- мембраны к парапету",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 375,
    "цена_300_600": 375,
    "цена_600_1000": 375,
    "цена_1000_3000": 375,
    "цена_3000_6000": 375,
    "цена_6000_15000": 375,
    "цена_15000_30000": 375,
    "цена_более_30000": 375
  },
  {
    "категория_работы": "Устройство прижимной и краевой алюминиевой планки",
    "наименование_работы": "Монтаж прижимной и краевой кровельной планки",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 90,
    "цена_300_600": 90,
    "цена_600_1000": 90,
    "цена_1000_3000": 90,
    "цена_3000_6000": 90,
    "цена_6000_15000": 90,
    "цена_15000_30000": 90,
    "цена_более_30000": 90
  },
  {
    "категория_работы": "Устройство гидроизоляции стоек фахверка с утеплением",
    "наименование_работы": "Устройство примыканий к стойкам фахверка с утеплением",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2920,
    "цена_300_600": 2920,
    "цена_600_1000": 2920,
    "цена_1000_3000": 2920,
    "цена_3000_6000": 2920,
    "цена_6000_15000": 2920,
    "цена_15000_30000": 2920,
    "цена_более_30000": 2920
  },
  {
    "категория_работы": "Устройство примыкания к вытяжкам",
    "наименование_работы": "Устройство примыкания к вытяжкам",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2080,
    "цена_300_600": 2080,
    "цена_600_1000": 2080,
    "цена_1000_3000": 2080,
    "цена_3000_6000": 2080,
    "цена_6000_15000": 2080,
    "цена_15000_30000": 2080,
    "цена_более_30000": 2080
  },
  {
    "категория_работы": "Устройство примыканий к воздухозаборам",
    "наименование_работы": "Устройство примыканий к воздухозаборам",
    "единица_измерения_работы": "шт",
    "цена_0_300": 3330,
    "цена_300_600": 3330,
    "цена_600_1000": 3330,
    "цена_1000_3000": 3330,
    "цена_3000_6000": 3330,
    "цена_6000_15000": 3330,
    "цена_15000_30000": 3330,
    "цена_более_30000": 3330
  },
  {
    "категория_работы": "Устройство примыканий к вентиляторам",
    "наименование_работы": "Устройство примыканий к вентиляторам",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2916,
    "цена_300_600": 2916,
    "цена_600_1000": 2916,
    "цена_1000_3000": 2916,
    "цена_3000_6000": 2916,
    "цена_6000_15000": 2916,
    "цена_15000_30000": 2916,
    "цена_более_30000": 2916
  },
  {
    "категория_работы": "Устройство деф. шва",
    "наименование_работы": "Устройство деф. Шва",
    "единица_измерения_работы": "шт",
    "цена_0_300": 200,
    "цена_300_600": 200,
    "цена_600_1000": 200,
    "цена_1000_3000": 200,
    "цена_3000_6000": 200,
    "цена_6000_15000": 200,
    "цена_15000_30000": 200,
    "цена_более_30000": 200
  },
  {
    "категория_работы": "Устройство примыканий к люкам дымоудаления",
    "наименование_работы": "Устройство примыканий к люкам дымоудаления",
    "единица_измерения_работы": "шт",
    "цена_0_300": 3260,
    "цена_300_600": 3260,
    "цена_600_1000": 3260,
    "цена_1000_3000": 3260,
    "цена_3000_6000": 3260,
    "цена_6000_15000": 3260,
    "цена_15000_30000": 3260,
    "цена_более_30000": 3260
  },
  {
    "категория_работы": "Устройство пешеходных дорожек Puzzle",
    "наименование_работы": "Устройство пешеходных дорожек Puzzle",
    "единица_измерения_работы": "шт",
    "цена_0_300": 250,
    "цена_300_600": 250,
    "цена_600_1000": 250,
    "цена_1000_3000": 250,
    "цена_3000_6000": 250,
    "цена_6000_15000": 250,
    "цена_15000_30000": 250,
    "цена_более_30000": 250
  },
  {
    "категория_работы": "Устройство примыканий стойкам блоков кондиционеров",
    "наименование_работы": "Устройство примыканий стойкам блоков кондиционеров",
    "единица_измерения_работы": "шт",
    "цена_0_300": 1666,
    "цена_300_600": 1666,
    "цена_600_1000": 1666,
    "цена_1000_3000": 1666,
    "цена_3000_6000": 1666,
    "цена_6000_15000": 1666,
    "цена_15000_30000": 1666,
    "цена_более_30000": 1666
  },
  {
    "категория_работы": "Устройство примыканий к проходкам через кровлю",
    "наименование_работы": "Устройство примыканий к проходкам",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2083,
    "цена_300_600": 2083,
    "цена_600_1000": 2083,
    "цена_1000_3000": 2083,
    "цена_3000_6000": 2083,
    "цена_6000_15000": 2083,
    "цена_15000_30000": 2083,
    "цена_более_30000": 2083
  },
  {
    "категория_работы": "Устройство примыкания к проходкам среднего сечения диамтером от 150 мм до 300 мм (к дефлекторам круглого сечения, трубам)",
    "наименование_работы": "Устройство примыкания к проходкам среднего сечения диамтером от 150 мм до 300 мм (к дефлекторам круглого сечения, трубам)",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2916,
    "цена_300_600": 2916,
    "цена_600_1000": 2916,
    "цена_1000_3000": 2916,
    "цена_3000_6000": 2916,
    "цена_6000_15000": 2916,
    "цена_15000_30000": 2916,
    "цена_более_30000": 2916
  },
  {
    "категория_работы": "Устройство примыканий к проходкам малого сечения диамтером до 150 мм (к гусакам для ввода кабеля, трубам и выводам)",
    "наименование_работы": "Устройство примыканий к проходкам малого сечения диамтером до 150 мм (к гусакам для ввода кабеля, трубам и выводам)",
    "единица_измерения_работы": "шт",
    "цена_0_300": 1666,
    "цена_300_600": 1666,
    "цена_600_1000": 1666,
    "цена_1000_3000": 1666,
    "цена_3000_6000": 1666,
    "цена_6000_15000": 1666,
    "цена_15000_30000": 1666,
    "цена_более_30000": 1666
  },
  {
    "категория_работы": "Устройство противопожарных рассечек 2*2 м вокруг зенитных фонарей, люков дымоудаления и дефлекторов из защитного материала NG",
    "наименование_работы": "Устройство противопожарных рассечек 2*2 м вокруг зенитных фонарей, люков дымоудаления и дефлекторов из защитного материала NG",
    "единица_измерения_работы": "м2",
    "цена_0_300": 366.5,
    "цена_300_600": 366.5,
    "цена_600_1000": 366.5,
    "цена_1000_3000": 366.5,
    "цена_3000_6000": 366.5,
    "цена_6000_15000": 366.5,
    "цена_15000_30000": 366.5,
    "цена_более_30000": 366.5
  },
  {
    "категория_работы": "Устройство парапетных крышек",
    "наименование_работы": "Изготовление парапетных крышек",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 500,
    "цена_300_600": 500,
    "цена_600_1000": 500,
    "цена_1000_3000": 500,
    "цена_3000_6000": 500,
    "цена_6000_15000": 500,
    "цена_15000_30000": 500,
    "цена_более_30000": 500
  },
  {
    "категория_работы": "Устройство парапетных крышек",
    "наименование_работы": "Устройство парапетных крышек",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 550,
    "цена_300_600": 550,
    "цена_600_1000": 550,
    "цена_1000_3000": 550,
    "цена_3000_6000": 550,
    "цена_6000_15000": 550,
    "цена_15000_30000": 550,
    "цена_более_30000": 550
  },
  {
    "категория_работы": "Устройство водоприемных воронок",
    "наименование_работы": "Монтаж воронок внутреннего водоотведения",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2000,
    "цена_300_600": 2000,
    "цена_600_1000": 2000,
    "цена_1000_3000": 2000,
    "цена_3000_6000": 2000,
    "цена_6000_15000": 2000,
    "цена_15000_30000": 2000,
    "цена_более_30000": 2000
  },
  {
    "категория_работы": "Устройство водоприемных воронок",
    "наименование_работы": "Монтаж воронок внешнего водоотведения",
    "единица_измерения_работы": "шт",
    "цена_0_300": 1666,
    "цена_300_600": 1666,
    "цена_600_1000": 1666,
    "цена_1000_3000": 1666,
    "цена_3000_6000": 1666,
    "цена_6000_15000": 1666,
    "цена_15000_30000": 1666,
    "цена_более_30000": 1666
  },
  {
    "категория_работы": "Накладные, транспортные, организационные и утилизационные расходы:",
    "наименование_работы": "Организационные и транспортные расходы:",
    "единица_измерения_работы": "ед",
    "цена_0_300": 230000,
    "цена_300_600": 230000,
    "цена_600_1000": 230000,
    "цена_1000_3000": 230000,
    "цена_3000_6000": 230000,
    "цена_6000_15000": 230000,
    "цена_15000_30000": 230000,
    "цена_более_30000": 230000
  },
  {
    "категория_работы": "Накладные, транспортные, организационные и утилизационные расходы:",
    "наименование_работы": "Подъемы и механизмы:",
    "единица_измерения_работы": "ед",
    "цена_0_300": 32000,
    "цена_300_600": 32000,
    "цена_600_1000": 32000,
    "цена_1000_3000": 32000,
    "цена_3000_6000": 32000,
    "цена_6000_15000": 32000,
    "цена_15000_30000": 32000,
    "цена_более_30000": 32000
  },
  {
    "категория_работы": "Накладные, транспортные, организационные и утилизационные расходы:",
    "наименование_работы": "Утилизация и вывоз мусора",
    "единица_измерения_работы": "ед",
    "цена_0_300": 15000,
    "цена_300_600": 15000,
    "цена_600_1000": 15000,
    "цена_1000_3000": 15000,
    "цена_3000_6000": 15000,
    "цена_6000_15000": 15000,
    "цена_15000_30000": 15000,
    "цена_более_30000": 15000
  },
  {
    "категория_работы": "Общие работы",
    "наименование_работы": "Мин. плита Технолайт Экстра 1200х600х100мм",
    "единица_измерения_работы": "м3",
    "цена_0_300": 3700,
    "цена_300_600": 3700,
    "цена_600_1000": 3700,
    "цена_1000_3000": 3700,
    "цена_3000_6000": 3700,
    "цена_6000_15000": 3700,
    "цена_15000_30000": 3700,
    "цена_более_30000": 3700
  },
  {
    "категория_работы": "Общие работы",
    "наименование_работы": "L-образный профиль",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 1300,
    "цена_300_600": 1300,
    "цена_600_1000": 1300,
    "цена_1000_3000": 1300,
    "цена_3000_6000": 1300,
    "цена_6000_15000": 1300,
    "цена_15000_30000": 1300,
    "цена_более_30000": 1300
  },
  {
    "категория_работы": "Общие работы",
    "наименование_работы": "Саморез кровельный 4.8х29 сверлоконечный шайба EPDM",
    "единица_измерения_работы": "шт",
    "цена_0_300": 5,
    "цена_300_600": 5,
    "цена_600_1000": 5,
    "цена_1000_3000": 5,
    "цена_3000_6000": 5,
    "цена_6000_15000": 5,
    "цена_15000_30000": 5,
    "цена_более_30000": 5
  },
  {
    "категория_работы": "Общие работы",
    "наименование_работы": "Пароизоляционная пленка ТехноНИКОЛЬ",
    "единица_измерения_работы": "м2",
    "цена_0_300": 19.9,
    "цена_300_600": 19.9,
    "цена_600_1000": 19.9,
    "цена_1000_3000": 19.9,
    "цена_3000_6000": 19.9,
    "цена_6000_15000": 19.9,
    "цена_15000_30000": 19.9,
    "цена_более_30000": 19.9
  },
  {
    "категория_работы": "Общие работы",
    "наименование_работы": "Двусторонний скотч",
    "единица_измерения_работы": "шт",
    "цена_0_300": 308,
    "цена_300_600": 308,
    "цена_600_1000": 308,
    "цена_1000_3000": 308,
    "цена_3000_6000": 308,
    "цена_6000_15000": 308,
    "цена_15000_30000": 308,
    "цена_более_30000": 308
  },
  {
    "категория_работы": "Общие работы",
    "наименование_работы": "Теплоизоляционный материал ТЕХНОРУФ В ЭКСТРА 50 мм",
    "единица_измерения_работы": "м3",
    "цена_0_300": 16112,
    "цена_300_600": 16112,
    "цена_600_1000": 16112,
    "цена_1000_3000": 16112,
    "цена_3000_6000": 16112,
    "цена_6000_15000": 16112,
    "цена_15000_30000": 16112,
    "цена_более_30000": 16112
  },
  {
    "категория_работы": "Общие работы",
    "наименование_работы": "Саморез сверлоконечный ТехноНИКОЛЬ 4,8х80 мм",
    "единица_измерения_работы": "шт",
    "цена_0_300": 13,
    "цена_300_600": 13,
    "цена_600_1000": 13,
    "цена_1000_3000": 13,
    "цена_3000_6000": 13,
    "цена_6000_15000": 13,
    "цена_15000_30000": 13,
    "цена_более_30000": 13
  },
  {
    "категория_работы": "Общие работы",
    "наименование_работы": "ПВХ Logicroof V-RP 1,2 мм мембрана серая 2,10x25 м",
    "единица_измерения_работы": "м2",
    "цена_0_300": 931,
    "цена_300_600": 931,
    "цена_600_1000": 931,
    "цена_1000_3000": 931,
    "цена_3000_6000": 931,
    "цена_6000_15000": 931,
    "цена_15000_30000": 931,
    "цена_более_30000": 931
  },
  {
    "категория_работы": "Общие работы",
    "наименование_работы": "ПВХ Logicroof V-SR 1,5 мм мембрана серая 2 шт. 1x10 м",
    "единица_измерения_работы": "рул.",
    "цена_0_300": 1350,
    "цена_300_600": 1350,
    "цена_600_1000": 1350,
    "цена_1000_3000": 1350,
    "цена_3000_6000": 1350,
    "цена_6000_15000": 1350,
    "цена_15000_30000": 1350,
    "цена_более_30000": 1350
  },
  {
    "категория_работы": "Устройство прижимной и краевой алюминиевой планки",
    "наименование_работы": "Прижимная кровельная планка алюминиевая 30*2000мм",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 116,
    "цена_300_600": 116,
    "цена_600_1000": 116,
    "цена_1000_3000": 116,
    "цена_3000_6000": 116,
    "цена_6000_15000": 116,
    "цена_15000_30000": 116,
    "цена_более_30000": 116
  },
  {
    "категория_работы": "Устройство прижимной и краевой алюминиевой планки",
    "наименование_работы": "Краевая кровельная планка алюминиевая 30*2000мм",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 150,
    "цена_300_600": 150,
    "цена_600_1000": 150,
    "цена_1000_3000": 150,
    "цена_3000_6000": 150,
    "цена_6000_15000": 150,
    "цена_15000_30000": 150,
    "цена_более_30000": 150
  },
  {
    "категория_работы": "Устройство прижимной и краевой алюминиевой планки",
    "наименование_работы": "Крепеж кровельный ТехноНИКОЛЬ (саморез 5,5*35)",
    "единица_измерения_работы": "шт",
    "цена_0_300": 8,
    "цена_300_600": 8,
    "цена_600_1000": 8,
    "цена_1000_3000": 8,
    "цена_3000_6000": 8,
    "цена_6000_15000": 8,
    "цена_15000_30000": 8,
    "цена_более_30000": 8
  },
  {
    "категория_работы": "Общие работы",
    "наименование_работы": "Очиститель для ПВХ мембраны, 3 л.",
    "единица_измерения_работы": "шт",
    "цена_0_300": 5162,
    "цена_300_600": 5162,
    "цена_600_1000": 5162,
    "цена_1000_3000": 5162,
    "цена_3000_6000": 5162,
    "цена_6000_15000": 5162,
    "цена_15000_30000": 5162,
    "цена_более_30000": 5162
  },
  {
    "категория_работы": "Общие работы",
    "наименование_работы": "Герметик ТЕХНОНИКОЛЬ ПУ MASTER, серый, туба 600 мл",
    "единица_измерения_работы": "шт",
    "цена_0_300": 440,
    "цена_300_600": 440,
    "цена_600_1000": 440,
    "цена_1000_3000": 440,
    "цена_3000_6000": 440,
    "цена_6000_15000": 440,
    "цена_15000_30000": 440,
    "цена_более_30000": 440
  },
  {
    "категория_работы": "Общие работы",
    "наименование_работы": "Саморез остроконечный ТехноНИКОЛЬ 4,8*50 (500 шт/уп)",
    "единица_измерения_работы": "шт",
    "цена_0_300": 7.5,
    "цена_300_600": 7.5,
    "цена_600_1000": 7.5,
    "цена_1000_3000": 7.5,
    "цена_3000_6000": 7.5,
    "цена_6000_15000": 7.5,
    "цена_15000_30000": 7.5,
    "цена_более_30000": 7.5
  },
  {
    "категория_работы": "Общие работы",
    "наименование_работы": "Телескопический крепеж TERMOCLIP 1, 20 мм",
    "единица_измерения_работы": "шт",
    "цена_0_300": 14,
    "цена_300_600": 14,
    "цена_600_1000": 14,
    "цена_1000_3000": 14,
    "цена_3000_6000": 14,
    "цена_6000_15000": 14,
    "цена_15000_30000": 14,
    "цена_более_30000": 14
  },
  {
    "категория_работы": "Устройство комбинированного теплоизоляционного слоя из МИ + ПИР (в два слоя), общей толщиной 150 мм",
    "наименование_работы": "Устройство комбинированного утеплителя (Минераловатный утеплитель 100 мм + экструдированный пенополистирол - 50 мм) 2 слоя с разбежкой швов, с общей толщиной 150 мм",
    "единица_измерения_работы": "м2",
    "цена_0_300": 300,
    "цена_300_600": 300,
    "цена_600_1000": 300,
    "цена_1000_3000": 300,
    "цена_3000_6000": 300,
    "цена_6000_15000": 300,
    "цена_15000_30000": 300,
    "цена_более_30000": 300
  },
  {
    "категория_работы": "Устройство комбинированного теплоизоляционного слоя из МИ + ПИР (в два слоя), общей толщиной 150 мм",
    "наименование_работы": "Механическое крепление теплоизоляционного слоя",
    "единица_измерения_работы": "м2",
    "цена_0_300": 50,
    "цена_300_600": 50,
    "цена_600_1000": 50,
    "цена_1000_3000": 50,
    "цена_3000_6000": 50,
    "цена_6000_15000": 50,
    "цена_15000_30000": 50,
    "цена_более_30000": 50
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости",
    "наименование_работы": "Устройство разделительного слоя из стеклохолста",
    "единица_измерения_работы": "м2",
    "цена_0_300": 60,
    "цена_300_600": 60,
    "цена_600_1000": 60,
    "цена_1000_3000": 60,
    "цена_3000_6000": 60,
    "цена_6000_15000": 60,
    "цена_15000_30000": 60,
    "цена_более_30000": 60
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны шириной 1 м, с продольным нахлестом не менее 120 мм и поперечным не менее 200 мм по профлисту",
    "единица_измерения_работы": "м2",
    "цена_0_300": 400,
    "цена_300_600": 400,
    "цена_600_1000": 400,
    "цена_1000_3000": 400,
    "цена_3000_6000": 400,
    "цена_6000_15000": 400,
    "цена_15000_30000": 400,
    "цена_более_30000": 400
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости",
    "наименование_работы": "Механическое крепление гидроизоляционного слоя",
    "единица_измерения_работы": "м2",
    "цена_0_300": 100,
    "цена_300_600": 100,
    "цена_600_1000": 100,
    "цена_1000_3000": 100,
    "цена_3000_6000": 100,
    "цена_6000_15000": 100,
    "цена_15000_30000": 100,
    "цена_более_30000": 100
  },
  {
    "категория_работы": "Устройство карнизного свеса и его гидроизоляция",
    "наименование_работы": "Монтаж бруса, 100*100",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 500,
    "цена_300_600": 500,
    "цена_600_1000": 500,
    "цена_1000_3000": 500,
    "цена_3000_6000": 500,
    "цена_6000_15000": 500,
    "цена_15000_30000": 500,
    "цена_более_30000": 500
  },
  {
    "категория_работы": "Устройство карнизного свеса и его гидроизоляция",
    "наименование_работы": "Монтаж ПВХ металла",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 200,
    "цена_300_600": 200,
    "цена_600_1000": 200,
    "цена_1000_3000": 200,
    "цена_3000_6000": 200,
    "цена_6000_15000": 200,
    "цена_15000_30000": 200,
    "цена_более_30000": 200
  },
  {
    "категория_работы": "Устройство карнизного свеса и его гидроизоляция",
    "наименование_работы": "Устройство примыкания к карнизному свесу",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 500,
    "цена_300_600": 500,
    "цена_600_1000": 500,
    "цена_1000_3000": 500,
    "цена_3000_6000": 500,
    "цена_6000_15000": 500,
    "цена_15000_30000": 500,
    "цена_более_30000": 500
  },
  {
    "категория_работы": "Устройство заполнения гофр профлиста НГ утеплителем на ширину 250 мм и монтаж L-образного профиля вдоль парапета",
    "наименование_работы": "Устройство L-образного профиля",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 160,
    "цена_300_600": 160,
    "цена_600_1000": 160,
    "цена_1000_3000": 160,
    "цена_3000_6000": 160,
    "цена_6000_15000": 160,
    "цена_15000_30000": 160,
    "цена_более_30000": 160
  },
  {
    "категория_работы": "Устройство гидроизоляции примыканий к парапетам из ПВХ-мембраны на высоту не более 450 мм, с окончанием примыкания через кревую рейку",
    "наименование_работы": "Устройство гидроизоляции примыканий к парапетам из ПВХ-мембраны на высоту не более 450 мм, с окончанием примыкания через кревую рейку",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 550,
    "цена_300_600": 550,
    "цена_600_1000": 550,
    "цена_1000_3000": 550,
    "цена_3000_6000": 550,
    "цена_6000_15000": 550,
    "цена_15000_30000": 550,
    "цена_более_30000": 550
  },
  {
    "категория_работы": "Устройство деформационного шва",
    "наименование_работы": "Устройство фасонного элемента",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 160,
    "цена_300_600": 160,
    "цена_600_1000": 160,
    "цена_1000_3000": 160,
    "цена_3000_6000": 160,
    "цена_6000_15000": 160,
    "цена_15000_30000": 160,
    "цена_более_30000": 160
  },
  {
    "категория_работы": "Устройство деформационного шва",
    "наименование_работы": "Устройство гидроизоляционного слоя",
    "единица_измерения_работы": "м2",
    "цена_0_300": 400,
    "цена_300_600": 400,
    "цена_600_1000": 400,
    "цена_1000_3000": 400,
    "цена_3000_6000": 400,
    "цена_6000_15000": 400,
    "цена_15000_30000": 400,
    "цена_более_30000": 400
  },
  {
    "категория_работы": "Устройство вертикальной водосточной трубы",
    "наименование_работы": "Монтаж вертикальной водосточной трубы, 3,7 м",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 600,
    "цена_300_600": 600,
    "цена_600_1000": 600,
    "цена_1000_3000": 600,
    "цена_3000_6000": 600,
    "цена_6000_15000": 600,
    "цена_15000_30000": 600,
    "цена_более_30000": 600
  },
  {
    "категория_работы": "Монтаж профилированного листа",
    "наименование_работы": "Монтаж профилированного листа Н75-750-0,8",
    "единица_измерения_работы": "м2",
    "цена_0_300": 230,
    "цена_300_600": 230,
    "цена_600_1000": 230,
    "цена_1000_3000": 230,
    "цена_3000_6000": 230,
    "цена_6000_15000": 230,
    "цена_15000_30000": 230,
    "цена_более_30000": 230
  },
  {
    "категория_работы": "Устройство комбинированного теплоизоляционного слоя из ПИР + ПИР (в два слоя), общей толщиной 80 мм",
    "наименование_работы": "Устройство комбинированного утеплителя (ПИР 40 мм + ПИР 40 мм) 2 слоя с разбежкой швов, с общей толщиной 80 мм",
    "единица_измерения_работы": "м2",
    "цена_0_300": 280,
    "цена_300_600": 280,
    "цена_600_1000": 280,
    "цена_1000_3000": 280,
    "цена_3000_6000": 280,
    "цена_6000_15000": 280,
    "цена_15000_30000": 280,
    "цена_более_30000": 280
  },
  {
    "категория_работы": "Устройство комбинированного теплоизоляционного слоя из ПИР + ПИР (в два слоя), общей толщиной 80 мм",
    "наименование_работы": "Механическое крепление теплоизоляционного слоя по профлисту",
    "единица_измерения_работы": "м2",
    "цена_0_300": 75,
    "цена_300_600": 75,
    "цена_600_1000": 75,
    "цена_1000_3000": 75,
    "цена_3000_6000": 75,
    "цена_6000_15000": 75,
    "цена_15000_30000": 75,
    "цена_более_30000": 75
  },
  {
    "категория_работы": "Устройство комбинированного теплоизоляционного слоя из ПИР + ПИР (в два слоя), общей толщиной 80 мм",
    "наименование_работы": "Механическое крепление теплоизоляционного слоя по ж/б",
    "единица_измерения_работы": "м2",
    "цена_0_300": 100,
    "цена_300_600": 100,
    "цена_600_1000": 100,
    "цена_1000_3000": 100,
    "цена_3000_6000": 100,
    "цена_6000_15000": 100,
    "цена_15000_30000": 100,
    "цена_более_30000": 100
  },
  {
    "категория_работы": "Устройство контруклона по основанию из ж/б плит покрытия клиновидными теплоизоляционными плитами из XPS",
    "наименование_работы": "Устройство контруклона из клиновидных плит XPS 4,2 %",
    "единица_измерения_работы": "м2",
    "цена_0_300": 170,
    "цена_300_600": 170,
    "цена_600_1000": 170,
    "цена_1000_3000": 170,
    "цена_3000_6000": 170,
    "цена_6000_15000": 170,
    "цена_15000_30000": 170,
    "цена_более_30000": 170
  },
  {
    "категория_работы": "Устройство контруклона по основанию из ж/б плит покрытия клиновидными теплоизоляционными плитами из XPS",
    "наименование_работы": "Механическое крепление клиновидного утеплителя",
    "единица_измерения_работы": "м2",
    "цена_0_300": 75,
    "цена_300_600": 75,
    "цена_600_1000": 75,
    "цена_1000_3000": 75,
    "цена_3000_6000": 75,
    "цена_6000_15000": 75,
    "цена_15000_30000": 75,
    "цена_более_30000": 75
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны шириной 2 м, с продольным нахлестом не менее 120 мм и поперечным не менее 200 мм по профлисту",
    "единица_измерения_работы": "м2",
    "цена_0_300": 310,
    "цена_300_600": 310,
    "цена_600_1000": 310,
    "цена_1000_3000": 310,
    "цена_3000_6000": 310,
    "цена_6000_15000": 310,
    "цена_15000_30000": 310,
    "цена_более_30000": 310
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны шириной 1 м, с продольным нахлестом не менее 120 мм и поперечным не менее 200 мм по профлисту с учетом ветровых зон по профлисту",
    "единица_измерения_работы": "м2",
    "цена_0_300": 385,
    "цена_300_600": 385,
    "цена_600_1000": 385,
    "цена_1000_3000": 385,
    "цена_3000_6000": 385,
    "цена_6000_15000": 385,
    "цена_15000_30000": 385,
    "цена_более_30000": 385
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости",
    "наименование_работы": "Механическое крепление гидроизоляционного слоя по профлисту",
    "единица_измерения_работы": "м2",
    "цена_0_300": 75,
    "цена_300_600": 75,
    "цена_600_1000": 75,
    "цена_1000_3000": 75,
    "цена_3000_6000": 75,
    "цена_6000_15000": 75,
    "цена_15000_30000": 75,
    "цена_более_30000": 75
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны шириной 2 м, с продольным нахлестом не менее 120 мм и поперечным не менее 200 мм по ж/б",
    "единица_измерения_работы": "м2",
    "цена_0_300": 385,
    "цена_300_600": 385,
    "цена_600_1000": 385,
    "цена_1000_3000": 385,
    "цена_3000_6000": 385,
    "цена_6000_15000": 385,
    "цена_15000_30000": 385,
    "цена_более_30000": 385
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны шириной 1 м, с продольным нахлестом не менее 120 мм и поперечным не менее 200 мм по профлисту с учетом ветровых зон по ж/б",
    "единица_измерения_работы": "м2",
    "цена_0_300": 480,
    "цена_300_600": 480,
    "цена_600_1000": 480,
    "цена_1000_3000": 480,
    "цена_3000_6000": 480,
    "цена_6000_15000": 480,
    "цена_15000_30000": 480,
    "цена_более_30000": 480
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости",
    "наименование_работы": "Механическое крепление гидроизоляционного слоя по ж/б",
    "единица_измерения_работы": "м2",
    "цена_0_300": 100,
    "цена_300_600": 100,
    "цена_600_1000": 100,
    "цена_1000_3000": 100,
    "цена_3000_6000": 100,
    "цена_6000_15000": 100,
    "цена_15000_30000": 100,
    "цена_более_30000": 100
  },
  {
    "категория_работы": "Устройство карнизного свеса и его гидроизоляция",
    "наименование_работы": "Монтаж капельника из металла",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 180,
    "цена_300_600": 180,
    "цена_600_1000": 180,
    "цена_1000_3000": 180,
    "цена_3000_6000": 180,
    "цена_6000_15000": 180,
    "цена_15000_30000": 180,
    "цена_более_30000": 180
  },
  {
    "категория_работы": "Устройство гидроизоляции примыканий к парапетам из ПВХ-мембраны на высоту не более 450 мм, с окончанием примыкания через кревую рейку",
    "наименование_работы": "Устройство гидроизоляции примыканий к парапетам из ПВХ-мембраны на высоту не более 450 мм, с окончанием примыкания через кревую рейку по сэндвич-панелям",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 430,
    "цена_300_600": 430,
    "цена_600_1000": 430,
    "цена_1000_3000": 430,
    "цена_3000_6000": 430,
    "цена_6000_15000": 430,
    "цена_15000_30000": 430,
    "цена_более_30000": 430
  },
  {
    "категория_работы": "Устройство гидроизоляции примыканий к парапетам из ПВХ-мембраны на высоту не более 450 мм, с окончанием примыкания через кревую рейку",
    "наименование_работы": "Устройство гидроизоляции примыканий к парапетам из ПВХ-мембраны на высоту не более 450 мм, с окончанием примыкания через кревую рейку по ж/б плитам",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 470,
    "цена_300_600": 470,
    "цена_600_1000": 470,
    "цена_1000_3000": 470,
    "цена_3000_6000": 470,
    "цена_6000_15000": 470,
    "цена_15000_30000": 470,
    "цена_более_30000": 470
  },
  {
    "категория_работы": "Устройство гидроизоляции стоек фахверка с утеплением",
    "наименование_работы": "Устройство примыканий к стойкам фахверка с утеплением по парапету из ж/б",
    "единица_измерения_работы": "шт",
    "цена_0_300": 3360,
    "цена_300_600": 3360,
    "цена_600_1000": 3360,
    "цена_1000_3000": 3360,
    "цена_3000_6000": 3360,
    "цена_6000_15000": 3360,
    "цена_15000_30000": 3360,
    "цена_более_30000": 3360
  },
  {
    "категория_работы": "Монтаж люков дымоудалений и устройство примыканий к люкам дымоудаления",
    "наименование_работы": "Монта люка дымоудаления",
    "единица_измерения_работы": "шт",
    "цена_0_300": 4000,
    "цена_300_600": 4000,
    "цена_600_1000": 4000,
    "цена_1000_3000": 4000,
    "цена_3000_6000": 4000,
    "цена_6000_15000": 4000,
    "цена_15000_30000": 4000,
    "цена_более_30000": 4000
  },
  {
    "категория_работы": "Монтаж люков дымоудалений и устройство примыканий к люкам дымоудаления",
    "наименование_работы": "Устройство контруклона из клиновидных плит XPS 4,2 % около люков дымоудаления",
    "единица_измерения_работы": "м2",
    "цена_0_300": 170,
    "цена_300_600": 170,
    "цена_600_1000": 170,
    "цена_1000_3000": 170,
    "цена_3000_6000": 170,
    "цена_6000_15000": 170,
    "цена_15000_30000": 170,
    "цена_более_30000": 170
  },
  {
    "категория_работы": "Устройство примыканий к ОВ и ВК",
    "наименование_работы": "Устройство примыканий к ОВ и ВК",
    "единица_измерения_работы": "шт",
    "цена_0_300": 3600,
    "цена_300_600": 3600,
    "цена_600_1000": 3600,
    "цена_1000_3000": 3600,
    "цена_3000_6000": 3600,
    "цена_6000_15000": 3600,
    "цена_15000_30000": 3600,
    "цена_более_30000": 3600
  },
  {
    "категория_работы": "Устройство водоприемных воронок",
    "наименование_работы": "Монтаж воронок наружнего водоотведения",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2000,
    "цена_300_600": 2000,
    "цена_600_1000": 2000,
    "цена_1000_3000": 2000,
    "цена_3000_6000": 2000,
    "цена_6000_15000": 2000,
    "цена_15000_30000": 2000,
    "цена_более_30000": 2000
  },
  {
    "категория_работы": "Устройство водоприемных воронок",
    "наименование_работы": "Монтаж кабельной системы противообледенения",
    "единица_измерения_работы": "пог. м.",
    "цена_0_300": 120,
    "цена_300_600": 120,
    "цена_600_1000": 120,
    "цена_1000_3000": 120,
    "цена_3000_6000": 120,
    "цена_6000_15000": 120,
    "цена_15000_30000": 120,
    "цена_более_30000": 120
  },
  {
    "категория_работы": "Монаж ограждающей конструкции и примыкание к стойкам ограждения",
    "наименование_работы": "Монтаж ограждающей конструкции",
    "единица_измерения_работы": "мп",
    "цена_0_300": 600,
    "цена_300_600": 600,
    "цена_600_1000": 600,
    "цена_1000_3000": 600,
    "цена_3000_6000": 600,
    "цена_6000_15000": 600,
    "цена_15000_30000": 600,
    "цена_более_30000": 600
  },
  {
    "категория_работы": "Монаж ограждающей конструкции и примыкание к стойкам ограждения",
    "наименование_работы": "Монтаж примыканий к стойкам ограждения",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2600,
    "цена_300_600": 2600,
    "цена_600_1000": 2600,
    "цена_1000_3000": 2600,
    "цена_3000_6000": 2600,
    "цена_6000_15000": 2600,
    "цена_15000_30000": 2600,
    "цена_более_30000": 2600
  },
  {
    "категория_работы": "Устройство ПВХ дорожки из Logicroof Walkway Puzzle",
    "наименование_работы": "Устройство ПВХ дорожки из Logicroof Walkway Puzzle",
    "единица_измерения_работы": "шт",
    "цена_0_300": 450,
    "цена_300_600": 450,
    "цена_600_1000": 450,
    "цена_1000_3000": 450,
    "цена_3000_6000": 450,
    "цена_6000_15000": 450,
    "цена_15000_30000": 450,
    "цена_более_30000": 450
  },
  {
    "категория_работы": "Подготовительные работы.",
    "наименование_работы": "Подготовка поверхности (зачистка поверхности, удаление наплывов, обеспыливание )",
    "единица_измерения_работы": "м2",
    "цена_0_300": 50,
    "цена_300_600": 50,
    "цена_600_1000": 50,
    "цена_1000_3000": 50,
    "цена_3000_6000": 50,
    "цена_6000_15000": 50,
    "цена_15000_30000": 50,
    "цена_более_30000": 50
  },
  {
    "категория_работы": "Устройство наплавляемой пароизоляции.",
    "наименование_работы": "Нанесение праймера в 1 слой. Плоскость и парапет",
    "единица_измерения_работы": "м2",
    "цена_0_300": 80,
    "цена_300_600": 80,
    "цена_600_1000": 80,
    "цена_1000_3000": 80,
    "цена_3000_6000": 80,
    "цена_6000_15000": 80,
    "цена_15000_30000": 80,
    "цена_более_30000": 80
  },
  {
    "категория_работы": "Устройство наплавляемой пароизоляции.",
    "наименование_работы": "Монтаж пароизоляции в 1 слой",
    "единица_измерения_работы": "м2",
    "цена_0_300": 270,
    "цена_300_600": 270,
    "цена_600_1000": 270,
    "цена_1000_3000": 270,
    "цена_3000_6000": 270,
    "цена_6000_15000": 270,
    "цена_15000_30000": 270,
    "цена_более_30000": 270
  },
  {
    "категория_работы": "Устройство утеплителя 150 мм.",
    "наименование_работы": "Устройство утеплителя в 3 слоя с пропениванием швов, перехлестом, толщиной 150мм.",
    "единица_измерения_работы": "м2",
    "цена_0_300": 400,
    "цена_300_600": 400,
    "цена_600_1000": 400,
    "цена_1000_3000": 400,
    "цена_3000_6000": 400,
    "цена_6000_15000": 400,
    "цена_15000_30000": 400,
    "цена_более_30000": 400
  },
  {
    "категория_работы": "Нанесение праймера в 1 слой. Плоскость и парапет.",
    "наименование_работы": "Нанесение праймера",
    "единица_измерения_работы": "м2",
    "цена_0_300": 80,
    "цена_300_600": 80,
    "цена_600_1000": 80,
    "цена_1000_3000": 80,
    "цена_3000_6000": 80,
    "цена_6000_15000": 80,
    "цена_15000_30000": 80,
    "цена_более_30000": 80
  },
  {
    "категория_работы": "Устройство гидроизоляции примыканий к фундаментам под оборудование высотой до 500 мм из битумосодержащего рулонного материала в два слоя.",
    "наименование_работы": "Устройство усиления галтели, внутренних и внешних углов.",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 150,
    "цена_300_600": 150,
    "цена_600_1000": 150,
    "цена_1000_3000": 150,
    "цена_3000_6000": 150,
    "цена_6000_15000": 150,
    "цена_15000_30000": 150,
    "цена_более_30000": 150
  },
  {
    "категория_работы": "Устройство гидроизоляции примыканий к фундаментам под оборудование высотой до 500 мм из битумосодержащего рулонного материала в два слоя.",
    "наименование_работы": "Монтаж гидроизоляции примыканий к фундаментам под оборудование высотой до 500 мм из полимеро-битумного наплавляемого материала в два слоя.",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 700,
    "цена_300_600": 700,
    "цена_600_1000": 700,
    "цена_1000_3000": 700,
    "цена_3000_6000": 700,
    "цена_6000_15000": 700,
    "цена_15000_30000": 700,
    "цена_более_30000": 700
  },
  {
    "категория_работы": "Устройство примыкания гидроизоляции к стенам, вент. проходам и выходу на кровлю высотой до 500 мм из битумосодержащего рулонного материала в два слоя.",
    "наименование_работы": "Монтаж гидроизоляции к стенам, вент. проходам и выходу на кровлю высотой до 500 мм из полимеро-битумного наплавляемого материала в два слоя.",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 700,
    "цена_300_600": 700,
    "цена_600_1000": 700,
    "цена_1000_3000": 700,
    "цена_3000_6000": 700,
    "цена_6000_15000": 700,
    "цена_15000_30000": 700,
    "цена_более_30000": 700
  },
  {
    "категория_работы": "Устройство примыкания гидроизоляции к стене высотой до 500 мм из битумосодержащего рулонного материала в два слоя.",
    "наименование_работы": "Монтаж краевой кровельной планки",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 150,
    "цена_300_600": 150,
    "цена_600_1000": 150,
    "цена_1000_3000": 150,
    "цена_3000_6000": 150,
    "цена_6000_15000": 150,
    "цена_15000_30000": 150,
    "цена_более_30000": 150
  },
  {
    "категория_работы": "Устройство примыкания гидроизоляции по оси А/1-7 до 500 мм из битумосодержащего рулонного материала в два слоя.",
    "наименование_работы": "Монтаж примыкания гидроизоляции по оси А/1-7 до 500 мм из полимеро-битумного наплавляемого материала в два слоя.",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 800,
    "цена_300_600": 800,
    "цена_600_1000": 800,
    "цена_1000_3000": 800,
    "цена_3000_6000": 800,
    "цена_6000_15000": 800,
    "цена_15000_30000": 800,
    "цена_более_30000": 800
  },
  {
    "категория_работы": "Устройство и гидроизоляции деформационного шва по оси В-Г/1-7 до 500 мм из битумосодержащего рулонного материала в два слоя.",
    "наименование_работы": "Монтаж гидроизоляции деформационного шва по оси В-Г/1-7 до 500 мм из полимеро-битумного наплавляемого материала в два слоя.",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 3000,
    "цена_300_600": 3000,
    "цена_600_1000": 3000,
    "цена_1000_3000": 3000,
    "цена_3000_6000": 3000,
    "цена_6000_15000": 3000,
    "цена_15000_30000": 3000,
    "цена_более_30000": 3000
  },
  {
    "категория_работы": "Устройство водоприемных воронок.",
    "наименование_работы": "Монтаж воронок с обогревом",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2500,
    "цена_300_600": 2500,
    "цена_600_1000": 2500,
    "цена_1000_3000": 2500,
    "цена_3000_6000": 2500,
    "цена_6000_15000": 2500,
    "цена_15000_30000": 2500,
    "цена_более_30000": 2500
  },
  {
    "категория_работы": "Устройство водоприемных воронок.",
    "наименование_работы": "Алмазное бурение",
    "единица_измерения_работы": "шт",
    "цена_0_300": 12000,
    "цена_300_600": 12000,
    "цена_600_1000": 12000,
    "цена_1000_3000": 12000,
    "цена_3000_6000": 12000,
    "цена_6000_15000": 12000,
    "цена_15000_30000": 12000,
    "цена_более_30000": 12000
  },
  {
    "категория_работы": "Устройство утеплителя 100 мм.",
    "наименование_работы": "Устройство утеплителя в 2 слоя с пропениванием швов, перехлестом, толщиной 100мм.",
    "единица_измерения_работы": "м2",
    "цена_0_300": 255,
    "цена_300_600": 255,
    "цена_600_1000": 255,
    "цена_1000_3000": 255,
    "цена_3000_6000": 255,
    "цена_6000_15000": 255,
    "цена_15000_30000": 255,
    "цена_более_30000": 255
  },
  {
    "категория_работы": "Устройство бортика из цементно-песчаного раствора М 150.",
    "наименование_работы": "Устройство бортика (галиель)",
    "единица_измерения_работы": "м.п",
    "цена_0_300": 250,
    "цена_300_600": 250,
    "цена_600_1000": 250,
    "цена_1000_3000": 250,
    "цена_3000_6000": 250,
    "цена_6000_15000": 250,
    "цена_15000_30000": 250,
    "цена_более_30000": 250
  },
  {
    "категория_работы": "Устройство примыкания гидроизоляции к стене высотой до 500 мм из битумосодержащего рулонного материала в два слоя.",
    "наименование_работы": "Монтаж гидроизоляционного покрытия на парапеты (и вент. шахты) до 500 мм из из полимеро-битумного наплавляемого материала в два слоя.",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 700,
    "цена_300_600": 700,
    "цена_600_1000": 700,
    "цена_1000_3000": 700,
    "цена_3000_6000": 700,
    "цена_6000_15000": 700,
    "цена_15000_30000": 700,
    "цена_более_30000": 700
  },
  {
    "категория_работы": "Устройство кровельных аэраторов.",
    "наименование_работы": "Монтаж кровельных аэраторов",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2500,
    "цена_300_600": 2500,
    "цена_600_1000": 2500,
    "цена_1000_3000": 2500,
    "цена_3000_6000": 2500,
    "цена_6000_15000": 2500,
    "цена_15000_30000": 2500,
    "цена_более_30000": 2500
  },
  {
    "категория_работы": "Устройство водоприемных воронок.",
    "наименование_работы": "Монтаж парапетных воронок",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2500,
    "цена_300_600": 2500,
    "цена_600_1000": 2500,
    "цена_1000_3000": 2500,
    "цена_3000_6000": 2500,
    "цена_6000_15000": 2500,
    "цена_15000_30000": 2500,
    "цена_более_30000": 2500
  },
  {
    "категория_работы": "Подготовительные работы.",
    "наименование_работы": "Подготовка поверхности (очистка поверхности)",
    "единица_измерения_работы": "м2",
    "цена_0_300": 50,
    "цена_300_600": 50,
    "цена_600_1000": 50,
    "цена_1000_3000": 50,
    "цена_3000_6000": 50,
    "цена_6000_15000": 50,
    "цена_15000_30000": 50,
    "цена_более_30000": 50
  },
  {
    "категория_работы": "Подготовительные работы.",
    "наименование_работы": "Устройство усиления мест воронок внутреннего водоотведения из оц. стали толщиной 0,5 мм",
    "единица_измерения_работы": "м2",
    "цена_0_300": 840,
    "цена_300_600": 840,
    "цена_600_1000": 840,
    "цена_1000_3000": 840,
    "цена_3000_6000": 840,
    "цена_6000_15000": 840,
    "цена_15000_30000": 840,
    "цена_более_30000": 840
  },
  {
    "категория_работы": "Устройство наплавляемой пароизоляции - Изоспан В.",
    "наименование_работы": "Монтаж пароизоляции (плоскость + заведение на парапет)",
    "единица_измерения_работы": "м2",
    "цена_0_300": 231,
    "цена_300_600": 231,
    "цена_600_1000": 231,
    "цена_1000_3000": 231,
    "цена_3000_6000": 231,
    "цена_6000_15000": 231,
    "цена_15000_30000": 231,
    "цена_более_30000": 231
  },
  {
    "категория_работы": "Устройство утеплителя из минераловатных плит - 150 мм.",
    "наименование_работы": "Устройство утеплителя в 2 слоя с перехлестом, толщиной 150мм.",
    "единица_измерения_работы": "м2",
    "цена_0_300": 320,
    "цена_300_600": 320,
    "цена_600_1000": 320,
    "цена_1000_3000": 320,
    "цена_3000_6000": 320,
    "цена_6000_15000": 320,
    "цена_15000_30000": 320,
    "цена_более_30000": 320
  },
  {
    "категория_работы": "Устройство контруклонов.",
    "наименование_работы": "Устройство контруклонов",
    "единица_измерения_работы": "м2",
    "цена_0_300": 460,
    "цена_300_600": 460,
    "цена_600_1000": 460,
    "цена_1000_3000": 460,
    "цена_3000_6000": 460,
    "цена_6000_15000": 460,
    "цена_15000_30000": 460,
    "цена_более_30000": 460
  },
  {
    "категория_работы": "Устройство сборной стяжки в 2 слоя ЦСП в нахлест - 25 мм.",
    "наименование_работы": "Устройство сборной стяжки в 2 слоя ЦСП в нахлест - 25 мм",
    "единица_измерения_работы": "м2",
    "цена_0_300": 525,
    "цена_300_600": 525,
    "цена_600_1000": 525,
    "цена_1000_3000": 525,
    "цена_3000_6000": 525,
    "цена_6000_15000": 525,
    "цена_15000_30000": 525,
    "цена_более_30000": 525
  },
  {
    "категория_работы": "Устройство гидроизоляционного слоя кровли из битумосодержащего рулонного материала.",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из рулонного материала Техноэласт Соло",
    "единица_измерения_работы": "м2",
    "цена_0_300": 315,
    "цена_300_600": 315,
    "цена_600_1000": 315,
    "цена_1000_3000": 315,
    "цена_3000_6000": 315,
    "цена_6000_15000": 315,
    "цена_15000_30000": 315,
    "цена_более_30000": 315
  },
  {
    "категория_работы": "Устройство гидроизоляционного слоя кровли из битумосодержащего рулонного материала.",
    "наименование_работы": "Механическое крепление гидроизоляционного слоя из рулонного материала Техноэласт Соло",
    "единица_измерения_работы": "м2",
    "цена_0_300": 50,
    "цена_300_600": 50,
    "цена_600_1000": 50,
    "цена_1000_3000": 50,
    "цена_3000_6000": 50,
    "цена_6000_15000": 50,
    "цена_15000_30000": 50,
    "цена_более_30000": 50
  },
  {
    "категория_работы": "Устройство примыкания гидроизоляции к стене высотой до 500 мм из битумосодержащего рулонного материала в два слоя.",
    "наименование_работы": "Устройство утепления и зашивка парапета из АЦЛ",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 600,
    "цена_300_600": 600,
    "цена_600_1000": 600,
    "цена_1000_3000": 600,
    "цена_3000_6000": 600,
    "цена_6000_15000": 600,
    "цена_15000_30000": 600,
    "цена_более_30000": 600
  },
  {
    "категория_работы": "Устройство примыкания гидроизоляции к стене высотой до 500 мм из битумосодержащего рулонного материала в два слоя.",
    "наименование_работы": "Устройство усиления галтели, внутренних и внешних углов",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 150,
    "цена_300_600": 150,
    "цена_600_1000": 150,
    "цена_1000_3000": 150,
    "цена_3000_6000": 150,
    "цена_6000_15000": 150,
    "цена_15000_30000": 150,
    "цена_более_30000": 150
  },
  {
    "категория_работы": "Устройство примыкания гидроизоляции к стене высотой до 500 мм из битумосодержащего рулонного материала в два слоя.",
    "наименование_работы": "Монтаж гидроизоляционного покрытия на парапеты (и вент. шахты) до 500 мм из из полимеро-битумного наплавляемого материала в два слоя",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 700,
    "цена_300_600": 700,
    "цена_600_1000": 700,
    "цена_1000_3000": 700,
    "цена_3000_6000": 700,
    "цена_6000_15000": 700,
    "цена_15000_30000": 700,
    "цена_более_30000": 700
  },
  {
    "категория_работы": "Устройство примыкания гидроизоляции к стене высотой до 500 мм из битумосодержащего рулонного материала в два слоя.",
    "наименование_работы": "Устройство фахверковых стоек",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2500,
    "цена_300_600": 2500,
    "цена_600_1000": 2500,
    "цена_1000_3000": 2500,
    "цена_3000_6000": 2500,
    "цена_6000_15000": 2500,
    "цена_15000_30000": 2500,
    "цена_более_30000": 2500
  },
  {
    "категория_работы": "Устройство сборной стяжки в 2 слоя ЦСП в нахлест - 20 мм.",
    "наименование_работы": "Устройство сборной стяжки в 2 слоя в нахлест - 20 мм",
    "единица_измерения_работы": "м2",
    "цена_0_300": 525,
    "цена_300_600": 525,
    "цена_600_1000": 525,
    "цена_1000_3000": 525,
    "цена_3000_6000": 525,
    "цена_6000_15000": 525,
    "цена_15000_30000": 525,
    "цена_более_30000": 525
  },
  {
    "категория_работы": "Устройство примыкания гидроизоляции к стене высотой до 500 мм из битумосодержащего рулонного материала в два слоя.",
    "наименование_работы": "Монтаж гидроизоляционного покрытия на парапеты (и вент. шахты) до 500 мм и карнизы из полимеро-битумного наплавляемого материала в два слоя",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 700,
    "цена_300_600": 700,
    "цена_600_1000": 700,
    "цена_1000_3000": 700,
    "цена_3000_6000": 700,
    "цена_6000_15000": 700,
    "цена_15000_30000": 700,
    "цена_более_30000": 700
  },
  {
    "категория_работы": "Устройство водоприемных воронок.",
    "наименование_работы": "Монтаж внешнего водоотведения",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 400,
    "цена_300_600": 400,
    "цена_600_1000": 400,
    "цена_1000_3000": 400,
    "цена_3000_6000": 400,
    "цена_6000_15000": 400,
    "цена_15000_30000": 400,
    "цена_более_30000": 400
  },
  {
    "категория_работы": "Устройство кровельного ограждения.",
    "наименование_работы": "Монтаж кровельного ограждения",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 600,
    "цена_300_600": 600,
    "цена_600_1000": 600,
    "цена_1000_3000": 600,
    "цена_3000_6000": 600,
    "цена_6000_15000": 600,
    "цена_15000_30000": 600,
    "цена_более_30000": 600
  },
  {
    "категория_работы": "Устройство кровельного ограждения.",
    "наименование_работы": "Монтаж примыканий к стойкам ограждение",
    "единица_измерения_работы": "шт",
    "цена_0_300": 1200,
    "цена_300_600": 1200,
    "цена_600_1000": 1200,
    "цена_1000_3000": 1200,
    "цена_3000_6000": 1200,
    "цена_6000_15000": 1200,
    "цена_15000_30000": 1200,
    "цена_более_30000": 1200
  },
  {
    "категория_работы": "Устройство гидроизоляционного слоя кровли из битумосодержащего рулонного материала.",
    "наименование_работы": "Праймирование основания",
    "единица_измерения_работы": "м2",
    "цена_0_300": 50,
    "цена_300_600": 50,
    "цена_600_1000": 50,
    "цена_1000_3000": 50,
    "цена_3000_6000": 50,
    "цена_6000_15000": 50,
    "цена_15000_30000": 50,
    "цена_более_30000": 50
  },
  {
    "категория_работы": "Устройство гидроизоляционного слоя кровли из битумосодержащего рулонного материала.",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из рулонного материала Унифлекс (1ый слой)",
    "единица_измерения_работы": "м2",
    "цена_0_300": 280,
    "цена_300_600": 280,
    "цена_600_1000": 280,
    "цена_1000_3000": 280,
    "цена_3000_6000": 280,
    "цена_6000_15000": 280,
    "цена_15000_30000": 280,
    "цена_более_30000": 280
  },
  {
    "категория_работы": "Устройство гидроизоляционного слоя кровли из битумосодержащего рулонного материала.",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из рулонного материала Техноэласт (2ой слой)",
    "единица_измерения_работы": "м2",
    "цена_0_300": 280,
    "цена_300_600": 280,
    "цена_600_1000": 280,
    "цена_1000_3000": 280,
    "цена_3000_6000": 280,
    "цена_6000_15000": 280,
    "цена_15000_30000": 280,
    "цена_более_30000": 280
  },
  {
    "категория_работы": "Демонтажные и подготовительные работы",
    "наименование_работы": "Демонтаж ПВХ-мембраны (рядовая кровля + примыкания)",
    "единица_измерения_работы": "м2",
    "цена_0_300": 344.4,
    "цена_300_600": 344.4,
    "цена_600_1000": 344.4,
    "цена_1000_3000": 344.4,
    "цена_3000_6000": 344.4,
    "цена_6000_15000": 344.4,
    "цена_15000_30000": 344.4,
    "цена_более_30000": 344.4
  },
  {
    "категория_работы": "Демонтажные и подготовительные работы",
    "наименование_работы": "Демонтаж теплоизоляционного слоя (минераловатный утеплитель + уклонобразующий слой)",
    "единица_измерения_работы": "м2",
    "цена_0_300": 488.78,
    "цена_300_600": 488.78,
    "цена_600_1000": 488.78,
    "цена_1000_3000": 488.78,
    "цена_3000_6000": 488.78,
    "цена_6000_15000": 488.78,
    "цена_15000_30000": 488.78,
    "цена_более_30000": 488.78
  },
  {
    "категория_работы": "Демонтажные и подготовительные работы",
    "наименование_работы": "Демонтаж воронок водоотведения",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2500,
    "цена_300_600": 2500,
    "цена_600_1000": 2500,
    "цена_1000_3000": 2500,
    "цена_3000_6000": 2500,
    "цена_6000_15000": 2500,
    "цена_15000_30000": 2500,
    "цена_более_30000": 2500
  },
  {
    "категория_работы": "Демонтажные и подготовительные работы",
    "наименование_работы": "Демонтаж парапетных крышек",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 250,
    "цена_300_600": 250,
    "цена_600_1000": 250,
    "цена_1000_3000": 250,
    "цена_3000_6000": 250,
    "цена_6000_15000": 250,
    "цена_15000_30000": 250,
    "цена_более_30000": 250
  },
  {
    "категория_работы": "Устройство пароизоляции",
    "наименование_работы": "Устройство пароизоляции из пленки",
    "единица_измерения_работы": "м2",
    "цена_0_300": 55,
    "цена_300_600": 55,
    "цена_600_1000": 55,
    "цена_1000_3000": 55,
    "цена_3000_6000": 55,
    "цена_6000_15000": 55,
    "цена_15000_30000": 55,
    "цена_более_30000": 55
  },
  {
    "категория_работы": "Устройство контруклона из теплоизоляционных плит XPS Carbon Slope 4,2%",
    "наименование_работы": "Устройство контруклона из теплоизоляционных плит XPS Carbon Slope 4,2%",
    "единица_измерения_работы": "м2",
    "цена_0_300": 350,
    "цена_300_600": 350,
    "цена_600_1000": 350,
    "цена_1000_3000": 350,
    "цена_3000_6000": 350,
    "цена_6000_15000": 350,
    "цена_15000_30000": 350,
    "цена_более_30000": 350
  },
  {
    "категория_работы": "Устройство утеплителя из ПИР в один слой, толщиной 80 мм",
    "наименование_работы": "Устройство утеплителя в 1 слой с перехлестом швов, толщиной 80 мм",
    "единица_измерения_работы": "м2",
    "цена_0_300": 300,
    "цена_300_600": 300,
    "цена_600_1000": 300,
    "цена_1000_3000": 300,
    "цена_3000_6000": 300,
    "цена_6000_15000": 300,
    "цена_15000_30000": 300,
    "цена_более_30000": 300
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны шириной 1 м, с продольным нахлестом не менее 120мм и поперечным 200мм (с механическим креплением)",
    "единица_измерения_работы": "м2",
    "цена_0_300": 430,
    "цена_300_600": 430,
    "цена_600_1000": 430,
    "цена_1000_3000": 430,
    "цена_3000_6000": 430,
    "цена_6000_15000": 430,
    "цена_15000_30000": 430,
    "цена_более_30000": 430
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны шириной 0.5 м, с продольным нахлестом не менее 120мм и поперечным 200мм (с механическим креплением)",
    "единица_измерения_работы": "м2",
    "цена_0_300": 600,
    "цена_300_600": 600,
    "цена_600_1000": 600,
    "цена_1000_3000": 600,
    "цена_3000_6000": 600,
    "цена_6000_15000": 600,
    "цена_15000_30000": 600,
    "цена_более_30000": 600
  },
  {
    "категория_работы": "Устройство гидроизоляции примыканий к парапету, вертикальным стенам и тумбам из ПВХ-мембраны",
    "наименование_работы": "Монтаж гидроизоляционного покрытия на парапеты (и вертикальные стены) из ПВХ-мембраны с окончанием под рейку (с промежуточным креплением)",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 950,
    "цена_300_600": 950,
    "цена_600_1000": 950,
    "цена_1000_3000": 950,
    "цена_3000_6000": 950,
    "цена_6000_15000": 950,
    "цена_15000_30000": 950,
    "цена_более_30000": 950
  },
  {
    "категория_работы": "Устройство гидроизоляции стоек фахверка",
    "наименование_работы": "Устройство гидроизоляции стоек фахверка",
    "единица_измерения_работы": "шт",
    "цена_0_300": 4000,
    "цена_300_600": 4000,
    "цена_600_1000": 4000,
    "цена_1000_3000": 4000,
    "цена_3000_6000": 4000,
    "цена_6000_15000": 4000,
    "цена_15000_30000": 4000,
    "цена_более_30000": 4000
  },
  {
    "категория_работы": "Устройство примыкания к проходкам",
    "наименование_работы": "Устройство примыкания к проходкам",
    "единица_измерения_работы": "шт",
    "цена_0_300": 2000,
    "цена_300_600": 2000,
    "цена_600_1000": 2000,
    "цена_1000_3000": 2000,
    "цена_3000_6000": 2000,
    "цена_6000_15000": 2000,
    "цена_15000_30000": 2000,
    "цена_более_30000": 2000
  },
  {
    "категория_работы": "Устройство водоприемных воронок",
    "наименование_работы": "Монтаж элементов усиления из оц. стали толщиной 0,5 мм",
    "единица_измерения_работы": "шт",
    "цена_0_300": 800,
    "цена_300_600": 800,
    "цена_600_1000": 800,
    "цена_1000_3000": 800,
    "цена_3000_6000": 800,
    "цена_6000_15000": 800,
    "цена_15000_30000": 800,
    "цена_более_30000": 800
  },
  {
    "категория_работы": "Устройство геотекстиля.",
    "наименование_работы": "Устройство геотекстиля с продольным нахлестом 100мм и поперечным 200мм. Плоскость и парапет",
    "единица_измерения_работы": "м2",
    "цена_0_300": 50,
    "цена_300_600": 50,
    "цена_600_1000": 50,
    "цена_1000_3000": 50,
    "цена_3000_6000": 50,
    "цена_6000_15000": 50,
    "цена_15000_30000": 50,
    "цена_более_30000": 50
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ мембраны по плоскости.",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны с продольным нахлестом 120мм и поперечным 200мм.",
    "единица_измерения_работы": "м2",
    "цена_0_300": 600,
    "цена_300_600": 600,
    "цена_600_1000": 600,
    "цена_1000_3000": 600,
    "цена_3000_6000": 600,
    "цена_6000_15000": 600,
    "цена_15000_30000": 600,
    "цена_более_30000": 600
  },
  {
    "категория_работы": "Устройство гидроизоляции парапета высотой до 400 мм из ПВХ мембраны.",
    "наименование_работы": "Монтаж гидроизоляционного покрытия на парапеты (и вент. шахты) до 450 мм из ПВХ мембраны с окончанием под прижимную и краевую рейку.",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 650,
    "цена_300_600": 650,
    "цена_600_1000": 650,
    "цена_1000_3000": 650,
    "цена_3000_6000": 650,
    "цена_6000_15000": 650,
    "цена_15000_30000": 650,
    "цена_более_30000": 650
  },
  {
    "категория_работы": "Монтаж профилированного листа",
    "наименование_работы": "Монтаж профилированного листа Н-75",
    "единица_измерения_работы": "м2",
    "цена_0_300": 250,
    "цена_300_600": 250,
    "цена_600_1000": 250,
    "цена_1000_3000": 250,
    "цена_3000_6000": 250,
    "цена_6000_15000": 250,
    "цена_15000_30000": 250,
    "цена_более_30000": 250
  },
  {
    "категория_работы": "Устройство контруклона из теплоизоляционных плит LogicPIR Slope 3,4%",
    "наименование_работы": "Устройство контруклона из теплоизоляционных плит LogicPIR Slope 3,4%",
    "единица_измерения_работы": "м2",
    "цена_0_300": 350,
    "цена_300_600": 350,
    "цена_600_1000": 350,
    "цена_1000_3000": 350,
    "цена_3000_6000": 350,
    "цена_6000_15000": 350,
    "цена_15000_30000": 350,
    "цена_более_30000": 350
  },
  {
    "категория_работы": "Устройство комбинированного теплоизоляционного слоя (Мин. Вата + ПИР) в два слоя с перехлестом швов, общей толщиной 100 мм",
    "наименование_работы": "Устройство комбинированного теплоизоляционного слоя (Мин. Вата + ПИР) в два слоя с перехлестом швов, общей толщиной 100 мм",
    "единица_измерения_работы": "м2",
    "цена_0_300": 280,
    "цена_300_600": 280,
    "цена_600_1000": 280,
    "цена_1000_3000": 280,
    "цена_3000_6000": 280,
    "цена_6000_15000": 280,
    "цена_15000_30000": 280,
    "цена_более_30000": 280
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости с учетом ветровых зон",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны шириной 2 м (центральная зона), с продольным нахлестом не менее 120 мм и поперечным не менее 200 мм",
    "единица_измерения_работы": "м2",
    "цена_0_300": 320,
    "цена_300_600": 320,
    "цена_600_1000": 320,
    "цена_1000_3000": 320,
    "цена_3000_6000": 320,
    "цена_6000_15000": 320,
    "цена_15000_30000": 320,
    "цена_более_30000": 320
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости с учетом ветровых зон",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны шириной 0.5-1 м (парапетная зона), с продольным нахлестом не менее 120 мм и поперечным не менее 200 мм. Общая ширина ветровой зоны - 12 м",
    "единица_измерения_работы": "м2",
    "цена_0_300": 420,
    "цена_300_600": 420,
    "цена_600_1000": 420,
    "цена_1000_3000": 420,
    "цена_3000_6000": 420,
    "цена_6000_15000": 420,
    "цена_15000_30000": 420,
    "цена_более_30000": 420
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости с учетом ветровых зон",
    "наименование_работы": "Механическое крепление гидроизоляционного слоя (крепление с учетом ветровых зон)",
    "единица_измерения_работы": "м2",
    "цена_0_300": 50,
    "цена_300_600": 50,
    "цена_600_1000": 50,
    "цена_1000_3000": 50,
    "цена_3000_6000": 50,
    "цена_6000_15000": 50,
    "цена_15000_30000": 50,
    "цена_более_30000": 50
  },
  {
    "категория_работы": "Устройство гидроизоляции примыканий к парапету из ПВХ-мембраны с высотой заведения более 450 мм (с промежуточным креплением)",
    "наименование_работы": "Устройство примыкания гидроизоляционного покрытия из ПВХ-мембраны к парапету, с заведением ПВХ-мембраны за парапет, с высотой заведения более 500 мм (с доутеплением)",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 1200,
    "цена_300_600": 1200,
    "цена_600_1000": 1200,
    "цена_1000_3000": 1200,
    "цена_3000_6000": 1200,
    "цена_6000_15000": 1200,
    "цена_15000_30000": 1200,
    "цена_более_30000": 1200
  },
  {
    "категория_работы": "Устройство примыкания к вытяжкам (В, ВД, ПД)",
    "наименование_работы": "Устройство примыкания к вытяжкам (В, ВД, ПД)",
    "единица_измерения_работы": "шт",
    "цена_0_300": 3000,
    "цена_300_600": 3000,
    "цена_600_1000": 3000,
    "цена_1000_3000": 3000,
    "цена_3000_6000": 3000,
    "цена_6000_15000": 3000,
    "цена_15000_30000": 3000,
    "цена_более_30000": 3000
  },
  {
    "категория_работы": "Устройство примыканий к гусакам для ввода кабеля",
    "наименование_работы": "Устройство примыканий к гусакам для ввода кабеля",
    "единица_измерения_работы": "шт",
    "цена_0_300": 1500,
    "цена_300_600": 1500,
    "цена_600_1000": 1500,
    "цена_1000_3000": 1500,
    "цена_3000_6000": 1500,
    "цена_6000_15000": 1500,
    "цена_15000_30000": 1500,
    "цена_более_30000": 1500
  },
  {
    "категория_работы": "Монтаж профилированного листа",
    "наименование_работы": "Монтаж профилированного листа",
    "единица_измерения_работы": "м2",
    "цена_0_300": 250,
    "цена_300_600": 250,
    "цена_600_1000": 250,
    "цена_1000_3000": 250,
    "цена_3000_6000": 250,
    "цена_6000_15000": 250,
    "цена_15000_30000": 250,
    "цена_более_30000": 250
  },
  {
    "категория_работы": "Устройство L-образного профиля в местах парапета и профилей усиления в ендове и на коньках. Заполнение гофр профлиста утеплителем НГ на длину 250 мм",
    "наименование_работы": "Заполнение гофр профлиста утеплителем НГ на длину 250 мм",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 100,
    "цена_300_600": 100,
    "цена_600_1000": 100,
    "цена_1000_3000": 100,
    "цена_3000_6000": 100,
    "цена_6000_15000": 100,
    "цена_15000_30000": 100,
    "цена_более_30000": 100
  },
  {
    "категория_работы": "Устройство карнизного свеса (монтаж бруса и ПВХ-металла)",
    "наименование_работы": "Монтаж бруса 100*100 мм",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 400,
    "цена_300_600": 400,
    "цена_600_1000": 400,
    "цена_1000_3000": 400,
    "цена_3000_6000": 400,
    "цена_6000_15000": 400,
    "цена_15000_30000": 400,
    "цена_более_30000": 400
  },
  {
    "категория_работы": "Устройство карнизного свеса (монтаж бруса и ПВХ-металла)",
    "наименование_работы": "Гибка изделия фасонного элемента из ПВХ-металла",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 500,
    "цена_300_600": 500,
    "цена_600_1000": 500,
    "цена_1000_3000": 500,
    "цена_3000_6000": 500,
    "цена_6000_15000": 500,
    "цена_15000_30000": 500,
    "цена_более_30000": 500
  },
  {
    "категория_работы": "Устройство карнизного свеса (монтаж бруса и ПВХ-металла)",
    "наименование_работы": "Монтаж фасонного элемента из ПВХ-металла",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 200,
    "цена_300_600": 200,
    "цена_600_1000": 200,
    "цена_1000_3000": 200,
    "цена_3000_6000": 200,
    "цена_6000_15000": 200,
    "цена_15000_30000": 200,
    "цена_более_30000": 200
  },
  {
    "категория_работы": "Устройство минераловатного утеплителя в два слоя, общей толщиной 120 мм",
    "наименование_работы": "Устройство минераловатного утеплителя в два слоя, общей толщиной 120 мм",
    "единица_измерения_работы": "м2",
    "цена_0_300": 400,
    "цена_300_600": 400,
    "цена_600_1000": 400,
    "цена_1000_3000": 400,
    "цена_3000_6000": 400,
    "цена_6000_15000": 400,
    "цена_15000_30000": 400,
    "цена_более_30000": 400
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны, с шириной рулона 2 м, с продольным нахлестом не менее 120мм и поперечным 200мм",
    "единица_измерения_работы": "м2",
    "цена_0_300": 400,
    "цена_300_600": 400,
    "цена_600_1000": 400,
    "цена_1000_3000": 400,
    "цена_3000_6000": 400,
    "цена_6000_15000": 400,
    "цена_15000_30000": 400,
    "цена_более_30000": 400
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ мембраны, с шириной рулона 0.5-1 м, с продольным нахлестом не менее 120мм и поперечным 200мм",
    "единица_измерения_работы": "м2",
    "цена_0_300": 500,
    "цена_300_600": 500,
    "цена_600_1000": 500,
    "цена_1000_3000": 500,
    "цена_3000_6000": 500,
    "цена_6000_15000": 500,
    "цена_15000_30000": 500,
    "цена_более_30000": 500
  },
  {
    "категория_работы": "Устройство гидроизоляционного покрытия из ПВХ-мембраны по плоскости",
    "наименование_работы": "Механическое крепление гидроизоляционного слоя с учетом ветровых зон",
    "единица_измерения_работы": "м2",
    "цена_0_300": 50,
    "цена_300_600": 50,
    "цена_600_1000": 50,
    "цена_1000_3000": 50,
    "цена_3000_6000": 50,
    "цена_6000_15000": 50,
    "цена_15000_30000": 50,
    "цена_более_30000": 50
  },
  {
    "категория_работы": "Устройство гидроизоляции примыканий к парапету и к карнизному свесу из ПВХ-мембраны",
    "наименование_работы": "Монтаж гидроизоляционного покрытия из ПВХ-мембраны к карнизному свесу",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 200,
    "цена_300_600": 200,
    "цена_600_1000": 200,
    "цена_1000_3000": 200,
    "цена_3000_6000": 200,
    "цена_6000_15000": 200,
    "цена_15000_30000": 200,
    "цена_более_30000": 200
  },
  {
    "категория_работы": "Устройство гидроизоляции примыканий к парапету и к карнизному свесу из ПВХ-мембраны",
    "наименование_работы": "Монтаж гидроизоляционного покрытия на парапеты (и вертикальные стены) из ПВХ-мембраны, с заведением за парапет",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 650,
    "цена_300_600": 650,
    "цена_600_1000": 650,
    "цена_1000_3000": 650,
    "цена_3000_6000": 650,
    "цена_6000_15000": 650,
    "цена_15000_30000": 650,
    "цена_более_30000": 650
  },
  {
    "категория_работы": "Устройство наружной водосточной системы",
    "наименование_работы": "Монтаж наружной водосточной системы (тип водосточной системы - не вандалостойкая)",
    "единица_измерения_работы": "м/п",
    "цена_0_300": 1000,
    "цена_300_600": 1000,
    "цена_600_1000": 1000,
    "цена_1000_3000": 1000,
    "цена_3000_6000": 1000,
    "цена_6000_15000": 1000,
    "цена_15000_30000": 1000,
    "цена_более_30000": 1000
  }
]

export const realBaseMaterialsFromUploadedEstimates = [
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Водосточный желоб",
    "единица_измерения": "м/п",
    "базовая_цена": 450,
    "ссылка": "",
    "базовое_наименование": "Водосточный желоб",
    "бренд": "",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Воронка водосточная ТехноНИКОЛЬ 110*720 с обогревом",
    "единица_измерения": "шт",
    "базовая_цена": 6850,
    "ссылка": "",
    "базовое_наименование": "Воронка водосточная ТехноНИКОЛЬ 110*720 с обогревом",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Воронка выпускная",
    "единица_измерения": "шт",
    "базовая_цена": 515,
    "ссылка": "",
    "базовое_наименование": "Воронка выпускная",
    "бренд": "",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Воронка кровельная с обогревом TERMOCLIP ВФО Ø110х450мм",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Воронка кровельная с обогревом TERMOCLIP ВФО Ø110х450мм",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Воронка парапетная ПВХ 100*100 мм, с отводом, листвоуловителем",
    "единица_измерения": "шт",
    "базовая_цена": 7000,
    "ссылка": "",
    "базовое_наименование": "Воронка парапетная ПВХ 100*100 мм, с отводом, листвоуловителем",
    "бренд": "",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Воронка парапетная Технониколь 100х100 мм (квадратное сечение, с галтелью)",
    "единица_измерения": "шт",
    "базовая_цена": 4000,
    "ссылка": "",
    "базовое_наименование": "Воронка парапетная Технониколь 100х100 мм (квадратное сечение, с галтелью)",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Желоб 3м МП",
    "единица_измерения": "шт",
    "базовая_цена": 1300,
    "ссылка": "",
    "базовое_наименование": "Желоб 3м МП",
    "бренд": "",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Заглушка желоба",
    "единица_измерения": "шт",
    "базовая_цена": 170,
    "ссылка": "",
    "базовое_наименование": "Заглушка желоба",
    "бренд": "",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Колено трубы D90×60 градусов (Белый)",
    "единица_измерения": "шт",
    "базовая_цена": 373,
    "ссылка": "",
    "базовое_наименование": "Колено трубы D90×60 градусов (Белый)",
    "бренд": "",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Кронштейн желоба МП",
    "единица_измерения": "шт",
    "базовая_цена": 430,
    "ссылка": "",
    "базовое_наименование": "Кронштейн желоба МП",
    "бренд": "",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Отводы для водосточного желоба",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Отводы для водосточного желоба",
    "бренд": "",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Парапетная воронка 100*100 мм с листоуловителем",
    "единица_измерения": "шт",
    "базовая_цена": 7000,
    "ссылка": "",
    "базовое_наименование": "Парапетная воронка 100*100 мм с листоуловителем",
    "бренд": "",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Сливное колено",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Сливное колено",
    "бренд": "",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Труба водосточная D90 (Белый) 1м",
    "единица_измерения": "шт",
    "базовая_цена": 460,
    "ссылка": "",
    "базовое_наименование": "Труба водосточная D90 (Белый) 1м",
    "бренд": "",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Труба водосточная D90 (Белый) 3м",
    "единица_измерения": "шт",
    "базовая_цена": 1210,
    "ссылка": "",
    "базовое_наименование": "Труба водосточная D90 (Белый) 3м",
    "бренд": "",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Хомут",
    "единица_измерения": "шт",
    "базовая_цена": 300,
    "ссылка": "",
    "базовое_наименование": "Хомут",
    "бренд": "",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Водоотведение",
    "подкатегория": "Воронки и водосток",
    "артикул_товара": "",
    "полное_наименование_материала": "Хомут для крепления водосточной трубы к стене",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Хомут для крепления водосточной трубы к стене",
    "бренд": "",
    "модель": "",
    "тип_материала": "Воронки и водосток"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "ПВХ мембраны",
    "артикул_товара": "",
    "полное_наименование_материала": "Армированная ПВХ мембрана Ecoplast V-RP",
    "единица_измерения": "м2",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Армированная ПВХ мембрана Ecoplast V-RP",
    "бренд": "",
    "модель": "",
    "тип_материала": "ПВХ мембраны"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "ПВХ мембраны",
    "артикул_товара": "",
    "полное_наименование_материала": "Армированная ПВХ мембрана Logicroof V-RP (или аналог)",
    "единица_измерения": "м2",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Армированная ПВХ мембрана Logicroof V-RP (или аналог)",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "ПВХ мембраны"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "БРМ",
    "артикул_товара": "",
    "полное_наименование_материала": "Биполь ЭПП",
    "единица_измерения": "м2",
    "базовая_цена": 301.05,
    "ссылка": "",
    "базовое_наименование": "Биполь ЭПП",
    "бренд": "",
    "модель": "",
    "тип_материала": "БРМ"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "Устройство примыкания гидроизоляции к кровельным проходам высотой до 300 мм из битумосодержащего рулонного материала в два слоя.",
    "артикул_товара": "",
    "полное_наименование_материала": "Кровельный аэратор",
    "единица_измерения": "шт",
    "базовая_цена": 2000,
    "ссылка": "",
    "базовое_наименование": "Кровельный аэратор",
    "бренд": "",
    "модель": "",
    "тип_материала": "Устройство примыкания гидроизоляции к кровельным проходам высотой до 300 мм из битумосодержащего рулонного материала в два слоя."
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "Устройство карнизного свеса и его гидроизоляция",
    "артикул_товара": "",
    "полное_наименование_материала": "Металлический капельник",
    "единица_измерения": "м/п",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Металлический капельник",
    "бренд": "",
    "модель": "",
    "тип_материала": "Устройство карнизного свеса и его гидроизоляция"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "Устройство карнизного свеса и его гидроизоляция",
    "артикул_товара": "",
    "полное_наименование_материала": "Металлический костыль",
    "единица_измерения": "шт",
    "базовая_цена": 200,
    "ссылка": "",
    "базовое_наименование": "Металлический костыль",
    "бренд": "",
    "модель": "",
    "тип_материала": "Устройство карнизного свеса и его гидроизоляция"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "ПВХ мембраны",
    "артикул_товара": "",
    "полное_наименование_материала": "Неармированная ПВХ мембрана V-SR",
    "единица_измерения": "рул",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Неармированная ПВХ мембрана V-SR",
    "бренд": "",
    "модель": "",
    "тип_материала": "ПВХ мембраны"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "ПВХ мембраны",
    "артикул_товара": "",
    "полное_наименование_материала": "Неармированная ПВХ-мембрана ТехноНИКОЛЬ LOGICROOF V-SR",
    "единица_измерения": "м2",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Неармированная ПВХ-мембрана ТехноНИКОЛЬ LOGICROOF V-SR",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "ПВХ мембраны"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "ПВХ мембраны",
    "артикул_товара": "",
    "полное_наименование_материала": "Очиститель для ПВХ мембран, 3 кг",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Очиститель для ПВХ мембран, 3 кг",
    "бренд": "",
    "модель": "",
    "тип_материала": "ПВХ мембраны"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "ПВХ мембраны",
    "артикул_товара": "",
    "полное_наименование_материала": "Очиститель для ПВХ мембраны, 3 л.",
    "единица_измерения": "шт",
    "базовая_цена": 4835.335,
    "ссылка": "",
    "базовое_наименование": "Очиститель для ПВХ мембраны, 3 л.",
    "бренд": "",
    "модель": "",
    "тип_материала": "ПВХ мембраны"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "ПВХ мембраны",
    "артикул_товара": "",
    "полное_наименование_материала": "Очиститель для ПВХ-мембран",
    "единица_измерения": "шт",
    "базовая_цена": 7950,
    "ссылка": "",
    "базовое_наименование": "Очиститель для ПВХ-мембран",
    "бренд": "",
    "модель": "",
    "тип_материала": "ПВХ мембраны"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "ПВХ мембраны",
    "артикул_товара": "",
    "полное_наименование_материала": "ПВХ Logicroof V-RP мембрана серая 2,10x25 м",
    "единица_измерения": "м2",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "ПВХ Logicroof V-RP мембрана серая 2,10x25 м",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "ПВХ мембраны"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "ПВХ мембраны",
    "артикул_товара": "",
    "полное_наименование_материала": "ПВХ Logicroof V-SR мембрана серая 2 шт. 1x10 м",
    "единица_измерения": "м2",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "ПВХ Logicroof V-SR мембрана серая 2 шт. 1x10 м",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "ПВХ мембраны"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "ПВХ мембраны",
    "артикул_товара": "",
    "полное_наименование_материала": "ПВХ дорожки из Logicroof Walkway Puzzle",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "ПВХ дорожки из Logicroof Walkway Puzzle",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "ПВХ мембраны"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "ПВХ мембраны",
    "артикул_товара": "",
    "полное_наименование_материала": "ПВХ мембрана.",
    "единица_измерения": "м2",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "ПВХ мембрана.",
    "бренд": "",
    "модель": "",
    "тип_материала": "ПВХ мембраны"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "Устройство карнизного свеса и его гидроизоляция",
    "артикул_товара": "",
    "полное_наименование_материала": "ПВХ металл, шириной 150 мм",
    "единица_измерения": "м/п",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "ПВХ металл, шириной 150 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Устройство карнизного свеса и его гидроизоляция"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "ПВХ мембраны",
    "артикул_товара": "",
    "полное_наименование_материала": "ПВХ-мембрана ТехноНИКОЛЬ LogicROOF V-RP",
    "единица_измерения": "м2",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "ПВХ-мембрана ТехноНИКОЛЬ LogicROOF V-RP",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "ПВХ мембраны"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "БРМ",
    "артикул_товара": "",
    "полное_наименование_материала": "Унифлекс ЭКП (2ой слой)",
    "единица_измерения": "м2",
    "базовая_цена": 399.29,
    "ссылка": "",
    "базовое_наименование": "Унифлекс ЭКП (2ой слой)",
    "бренд": "",
    "модель": "",
    "тип_материала": "БРМ"
  },
  {
    "главная_категория": "Гидроизоляция",
    "подкатегория": "БРМ",
    "артикул_товара": "",
    "полное_наименование_материала": "Унифлекс ЭПП (1ый слой)",
    "единица_измерения": "м2",
    "базовая_цена": 346.36,
    "ссылка": "",
    "базовое_наименование": "Унифлекс ЭПП (1ый слой)",
    "бренд": "",
    "модель": "",
    "тип_материала": "БРМ"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "L-образный профиль",
    "единица_измерения": "м/п",
    "базовая_цена": 1300,
    "ссылка": "",
    "базовое_наименование": "L-образный профиль",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Брус 100*100 мм",
    "единица_измерения": "м/п",
    "базовая_цена": 670,
    "ссылка": "",
    "базовое_наименование": "Брус 100*100 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Брус, 100*100",
    "единица_измерения": "м/п",
    "базовая_цена": 1817.043,
    "ссылка": "",
    "базовое_наименование": "Брус, 100*100",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Изделие (L-образный профиль) из оц. стали",
    "единица_измерения": "м/п",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Изделие (L-образный профиль) из оц. стали",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Изделие (L-образный профиль, коньковый усилитель) из оц. стали",
    "единица_измерения": "м/п",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Изделие (L-образный профиль, коньковый усилитель) из оц. стали",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Изделие из оц. стали 600*600 мм",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Изделие из оц. стали 600*600 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Краевая кровельная планка алюминиевая 2 м",
    "единица_измерения": "м/п",
    "базовая_цена": 180,
    "ссылка": "",
    "базовое_наименование": "Краевая кровельная планка алюминиевая 2 м",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Краевая кровельная планка алюминиевая 30*2000мм",
    "единица_измерения": "м/п",
    "базовая_цена": 116.9,
    "ссылка": "",
    "базовое_наименование": "Краевая кровельная планка алюминиевая 30*2000мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Краевая кровельная планка алюминиевая 30*3000мм",
    "единица_измерения": "м/п",
    "базовая_цена": 140,
    "ссылка": "",
    "базовое_наименование": "Краевая кровельная планка алюминиевая 30*3000мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "ПВХ-металл",
    "единица_измерения": "м2",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "ПВХ-металл",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Прижимная кровельная планка алюминиевая 30*2000мм",
    "единица_измерения": "м/п",
    "базовая_цена": 95.83,
    "ссылка": "",
    "базовое_наименование": "Прижимная кровельная планка алюминиевая 30*2000мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Прижимная кровельная планка алюминиевая 30*3000мм",
    "единица_измерения": "м/п",
    "базовая_цена": 140,
    "ссылка": "",
    "базовое_наименование": "Прижимная кровельная планка алюминиевая 30*3000мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Прижимная рейка",
    "единица_измерения": "м/п",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Прижимная рейка",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Профиль усиления (коньковые усиления, усиления ендов)",
    "единица_измерения": "м/п",
    "базовая_цена": 1300,
    "ссылка": "",
    "базовое_наименование": "Профиль усиления (коньковые усиления, усиления ендов)",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Профиль усиления деф. шва",
    "единица_измерения": "м/п",
    "базовая_цена": 1300,
    "ссылка": "",
    "базовое_наименование": "Профиль усиления деф. шва",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Рейка краевая ТехноНИКОЛЬ",
    "единица_измерения": "м/п",
    "базовая_цена": 112,
    "ссылка": "",
    "базовое_наименование": "Рейка краевая ТехноНИКОЛЬ",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Рейка краевая алюминиевая TERMOCLIP LITE 2 м (100 п.м./упак)",
    "единица_измерения": "пог. м",
    "базовая_цена": 116.9,
    "ссылка": "",
    "базовое_наименование": "Рейка краевая алюминиевая TERMOCLIP LITE 2 м (100 п.м./упак)",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Рейка прижимная ТехноНИКОЛЬ",
    "единица_измерения": "м/п",
    "базовая_цена": 107,
    "ссылка": "",
    "базовое_наименование": "Рейка прижимная ТехноНИКОЛЬ",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Доборные элементы",
    "подкатегория": "Профили и планки",
    "артикул_товара": "",
    "полное_наименование_материала": "Фасонное изделие из оц. стали",
    "единица_измерения": "м/п",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Фасонное изделие из оц. стали",
    "бренд": "",
    "модель": "",
    "тип_материала": "Профили и планки"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Анкерный элемент 8*45",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Анкерный элемент 8*45",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Анкерный элемент 8*45 мм",
    "единица_измерения": "шт",
    "базовая_цена": 3.5,
    "ссылка": "",
    "базовое_наименование": "Анкерный элемент 8*45 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Анкерный элемент TERMOCLIP 8*",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Анкерный элемент TERMOCLIP 8*",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Анкерный элемент TERMOCLIP 8* (2500шт/кор)",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Анкерный элемент TERMOCLIP 8* (2500шт/кор)",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Крепеж кровельный ТехноНИКОЛЬ (саморез 5,5*35)",
    "единица_измерения": "шт",
    "базовая_цена": 8,
    "ссылка": "",
    "базовое_наименование": "Крепеж кровельный ТехноНИКОЛЬ (саморез 5,5*35)",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Крепеж кровельный телескопический 100 мм",
    "единица_измерения": "шт",
    "базовая_цена": 8,
    "ссылка": "",
    "базовое_наименование": "Крепеж кровельный телескопический 100 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Крепеж кровельный телескопический 100 мм + саморез сверлоконечный 70 мм",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Крепеж кровельный телескопический 100 мм + саморез сверлоконечный 70 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Крепеж кровельный телескопический 60 мм",
    "единица_измерения": "шт",
    "базовая_цена": 7,
    "ссылка": "",
    "базовое_наименование": "Крепеж кровельный телескопический 60 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Крепеж кровельный телескопический 60 мм + саморез остроконечный 100 мм + анкер 8*45 мм",
    "единица_измерения": "шт",
    "базовая_цена": 18.5,
    "ссылка": "",
    "базовое_наименование": "Крепеж кровельный телескопический 60 мм + саморез остроконечный 100 мм + анкер 8*45 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Крепеж кровельный телескопический 80 мм",
    "единица_измерения": "шт",
    "базовая_цена": 7.5,
    "ссылка": "",
    "базовое_наименование": "Крепеж кровельный телескопический 80 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Крепежные элементы",
    "единица_измерения": "шт",
    "базовая_цена": 1500,
    "ссылка": "",
    "базовое_наименование": "Крепежные элементы",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Крепежный элемент для хомута (крепление к стене)",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Крепежный элемент для хомута (крепление к стене)",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Кровельная стальная шайба ТехноНИКОЛЬ D-50мм.",
    "единица_измерения": "шт",
    "базовая_цена": 6,
    "ссылка": "",
    "базовое_наименование": "Кровельная стальная шайба ТехноНИКОЛЬ D-50мм.",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Кровельный саморез 4.8*50 мм + анкер 8*45 мм",
    "единица_измерения": "шт",
    "базовая_цена": 8,
    "ссылка": "",
    "базовое_наименование": "Кровельный саморез 4.8*50 мм + анкер 8*45 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Кровельный саморез 6,3*130 мм",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Кровельный саморез 6,3*130 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Кровельный саморез остроконечный 120 мм",
    "единица_измерения": "шт",
    "базовая_цена": 17.5,
    "ссылка": "",
    "базовое_наименование": "Кровельный саморез остроконечный 120 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Кровельный саморез остроконечный 160 мм",
    "единица_измерения": "шт",
    "базовая_цена": 21,
    "ссылка": "",
    "базовое_наименование": "Кровельный саморез остроконечный 160 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Круглый тарельчатый держатель",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Круглый тарельчатый держатель",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Оцинкованные анодированные саморезы размером 5×40 мм",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Оцинкованные анодированные саморезы размером 5×40 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез 4,8*120 мм",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Саморез 4,8*120 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез 4,8*50 мм",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Саморез 4,8*50 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез для профлиста HARPOON HE5-R 5,5х32 углеродистая сталь SAE 1022 (1,2 шт/м2)",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Саморез для профлиста HARPOON HE5-R 5,5х32 углеродистая сталь SAE 1022 (1,2 шт/м2)",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез кровельный 4,8*19 мм",
    "единица_измерения": "шт",
    "базовая_цена": 3,
    "ссылка": "",
    "базовое_наименование": "Саморез кровельный 4,8*19 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез кровельный 4.8х29 сверлоконечный шайба EPDM",
    "единица_измерения": "шт",
    "базовая_цена": 3.8,
    "ссылка": "",
    "базовое_наименование": "Саморез кровельный 4.8х29 сверлоконечный шайба EPDM",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез кровельный 5,5*19 мм",
    "единица_измерения": "шт",
    "базовая_цена": 3.1,
    "ссылка": "",
    "базовое_наименование": "Саморез кровельный 5,5*19 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез кровельный 5,5*38 мм",
    "единица_измерения": "шт",
    "базовая_цена": 3.2,
    "ссылка": "",
    "базовое_наименование": "Саморез кровельный 5,5*38 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез остроконечный ТехноНИКОЛЬ 4,8*50 (500 шт/уп)",
    "единица_измерения": "шт",
    "базовая_цена": 5.655,
    "ссылка": "",
    "базовое_наименование": "Саморез остроконечный ТехноНИКОЛЬ 4,8*50 (500 шт/уп)",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез остроконечный ТехноНИКОЛЬ 4,8х 120 мм",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Саморез остроконечный ТехноНИКОЛЬ 4,8х 120 мм",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез остроконечный ТехноНИКОЛЬ 4,8х 160 мм",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Саморез остроконечный ТехноНИКОЛЬ 4,8х 160 мм",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез остроконечный ТехноНИКОЛЬ 4,8х80 мм",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Саморез остроконечный ТехноНИКОЛЬ 4,8х80 мм",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез остроконечный ТехноНИКОЛЬ 5,5*35 (1000 шт/уп)",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Саморез остроконечный ТехноНИКОЛЬ 5,5*35 (1000 шт/уп)",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез сверлоконечный TERMOCLIP 4,8х",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Саморез сверлоконечный TERMOCLIP 4,8х",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез сверлоконечный ТехноНИКОЛЬ 4,8х60 мм",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Саморез сверлоконечный ТехноНИКОЛЬ 4,8х60 мм",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез сверлоконечный ТехноНИКОЛЬ 4,8х80 мм",
    "единица_измерения": "шт",
    "базовая_цена": 9.765,
    "ссылка": "",
    "базовое_наименование": "Саморез сверлоконечный ТехноНИКОЛЬ 4,8х80 мм",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморез сверлоконечный ТехноНИКОЛЬ 5,5*35 (1000 шт/уп)",
    "единица_измерения": "шт",
    "базовая_цена": 6.535,
    "ссылка": "",
    "базовое_наименование": "Саморез сверлоконечный ТехноНИКОЛЬ 5,5*35 (1000 шт/уп)",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Саморезы по дереву диаметром 3–4 мм длиной 35 мм",
    "единица_измерения": "м/п",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Саморезы по дереву диаметром 3–4 мм длиной 35 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Крепеж",
    "подкатегория": "Кровельный крепеж",
    "артикул_товара": "",
    "полное_наименование_материала": "Телескопический крепеж TERMOCLIP 1",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Телескопический крепеж TERMOCLIP 1",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Кровельный крепеж"
  },
  {
    "главная_категория": "Пароизоляция",
    "подкатегория": "Расходники",
    "артикул_товара": "",
    "полное_наименование_материала": "Двусторонний скотч",
    "единица_измерения": "шт",
    "базовая_цена": 249.18,
    "ссылка": "",
    "базовое_наименование": "Двусторонний скотч",
    "бренд": "",
    "модель": "",
    "тип_материала": "Расходники"
  },
  {
    "главная_категория": "Пароизоляция",
    "подкатегория": "Пленки",
    "артикул_товара": "",
    "полное_наименование_материала": "Пароизоляционная пленка ТехноНИКОЛЬ",
    "единица_измерения": "м2",
    "базовая_цена": 23.17,
    "ссылка": "",
    "базовое_наименование": "Пароизоляционная пленка ТехноНИКОЛЬ",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Пленки"
  },
  {
    "главная_категория": "Пароизоляция",
    "подкатегория": "Пленки",
    "артикул_товара": "",
    "полное_наименование_материала": "Пленка пароизоляционная ТехноНИКОЛЬ",
    "единица_измерения": "м2",
    "базовая_цена": 40,
    "ссылка": "",
    "базовое_наименование": "Пленка пароизоляционная ТехноНИКОЛЬ",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Пленки"
  },
  {
    "главная_категория": "Пароизоляция",
    "подкатегория": "Расходники",
    "артикул_товара": "",
    "полное_наименование_материала": "Скотч двусторонний, 25м",
    "единица_измерения": "шт",
    "базовая_цена": 350,
    "ссылка": "",
    "базовое_наименование": "Скотч двусторонний, 25м",
    "бренд": "",
    "модель": "",
    "тип_материала": "Расходники"
  },
  {
    "главная_категория": "Прочее",
    "подкатегория": "Устройство противопожарных рассечек 2*2 м вокруг зенитных фонарей, люков дымоудаления и дефлекторов из защитного материала NG",
    "артикул_товара": "",
    "полное_наименование_материала": "NG",
    "единица_измерения": "м2",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "NG",
    "бренд": "",
    "модель": "",
    "тип_материала": "Устройство противопожарных рассечек 2*2 м вокруг зенитных фонарей, люков дымоудаления и дефлекторов из защитного материала NG"
  },
  {
    "главная_категория": "Прочее",
    "подкатегория": "Устройство L-образного профиля в местах парапета и профилей усиления в ендове и на коньках",
    "артикул_товара": "",
    "полное_наименование_материала": "Дюбель-гвоздь 6*40 мм",
    "единица_измерения": "шт",
    "базовая_цена": 2,
    "ссылка": "",
    "базовое_наименование": "Дюбель-гвоздь 6*40 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Устройство L-образного профиля в местах парапета и профилей усиления в ендове и на коньках"
  },
  {
    "главная_категория": "Прочее",
    "подкатегория": "Устройство краевой алюминиевой планки.",
    "артикул_товара": "",
    "полное_наименование_материала": "Дюбель-гвоздь грибовидный 6*60мм.",
    "единица_измерения": "шт",
    "базовая_цена": 3.35,
    "ссылка": "",
    "базовое_наименование": "Дюбель-гвоздь грибовидный 6*60мм.",
    "бренд": "",
    "модель": "",
    "тип_материала": "Устройство краевой алюминиевой планки."
  },
  {
    "главная_категория": "Прочее",
    "подкатегория": "Монтаж профилированного листа",
    "артикул_товара": "",
    "полное_наименование_материала": "Заклепка вытяжная комбинированная 4,8х20 мм",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Заклепка вытяжная комбинированная 4,8х20 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Монтаж профилированного листа"
  },
  {
    "главная_категория": "Прочее",
    "подкатегория": "Монаж ограждающей конструкции и примыкание к стойкам ограждения",
    "артикул_товара": "",
    "полное_наименование_материала": "Кровельное ограждение ТехноНИКОЛЬ ККО/СК/600-2",
    "единица_измерения": "шт",
    "базовая_цена": 7500,
    "ссылка": "",
    "базовое_наименование": "Кровельное ограждение ТехноНИКОЛЬ ККО/СК/600-2",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Монаж ограждающей конструкции и примыкание к стойкам ограждения"
  },
  {
    "главная_категория": "Прочее",
    "подкатегория": "Устройство наружной водосточной системы",
    "артикул_товара": "",
    "полное_наименование_материала": "Кронштейн трубы",
    "единица_измерения": "шт",
    "базовая_цена": 150,
    "ссылка": "",
    "базовое_наименование": "Кронштейн трубы",
    "бренд": "",
    "модель": "",
    "тип_материала": "Устройство наружной водосточной системы"
  },
  {
    "главная_категория": "Прочее",
    "подкатегория": "Устройство усиления мест воронок внутреннего водоотведения",
    "артикул_товара": "",
    "полное_наименование_материала": "Оцинкованный лист, толщ. 0,7 мм, 600*600 мм",
    "единица_измерения": "шт",
    "базовая_цена": 1300,
    "ссылка": "",
    "базовое_наименование": "Оцинкованный лист, толщ. 0,7 мм, 600*600 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Устройство усиления мест воронок внутреннего водоотведения"
  },
  {
    "главная_категория": "Прочее",
    "подкатегория": "Устройство водоприемных воронок",
    "артикул_товара": "",
    "полное_наименование_материала": "Прогевочный кабель противообледенения",
    "единица_измерения": "пог. м.",
    "базовая_цена": 800,
    "ссылка": "",
    "базовое_наименование": "Прогевочный кабель противообледенения",
    "бренд": "",
    "модель": "",
    "тип_материала": "Устройство водоприемных воронок"
  },
  {
    "главная_категория": "Прочее",
    "подкатегория": "Монтаж профилированного листа",
    "артикул_товара": "",
    "полное_наименование_материала": "Профилированный лист Н60-845-0,7 мм",
    "единица_измерения": "м2",
    "базовая_цена": 1051.754,
    "ссылка": "",
    "базовое_наименование": "Профилированный лист Н60-845-0,7 мм",
    "бренд": "",
    "модель": "",
    "тип_материала": "Монтаж профилированного листа"
  },
  {
    "главная_категория": "Прочее",
    "подкатегория": "Монтаж профилированного листа",
    "артикул_товара": "",
    "полное_наименование_материала": "Профилированный лист Н75-750-0,8",
    "единица_измерения": "м2",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Профилированный лист Н75-750-0,8",
    "бренд": "",
    "модель": "",
    "тип_материала": "Монтаж профилированного листа"
  },
  {
    "главная_категория": "Разделительные слои",
    "подкатегория": "Геотекстиль и мембраны",
    "артикул_товара": "",
    "полное_наименование_материала": "Геотекстиль нетканый термообработанный 150 г/м2",
    "единица_измерения": "м2",
    "базовая_цена": 100,
    "ссылка": "",
    "базовое_наименование": "Геотекстиль нетканый термообработанный 150 г/м2",
    "бренд": "",
    "модель": "",
    "тип_материала": "Геотекстиль и мембраны"
  },
  {
    "главная_категория": "Разделительные слои",
    "подкатегория": "Геотекстиль и мембраны",
    "артикул_товара": "",
    "полное_наименование_материала": "Стеклохолст",
    "единица_измерения": "м2",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Стеклохолст",
    "бренд": "",
    "модель": "",
    "тип_материала": "Геотекстиль и мембраны"
  },
  {
    "главная_категория": "Расходники",
    "подкатегория": "Газ",
    "артикул_товара": "",
    "полное_наименование_материала": "Газ пропан",
    "единица_измерения": "л.",
    "базовая_цена": 38,
    "ссылка": "",
    "базовое_наименование": "Газ пропан",
    "бренд": "",
    "модель": "",
    "тип_материала": "Газ"
  },
  {
    "главная_категория": "Смеси",
    "подкатегория": "Растворы",
    "артикул_товара": "",
    "полное_наименование_материала": "Песок, цемент М-500, фибра, пленка",
    "единица_измерения": "кг",
    "базовая_цена": 7,
    "ссылка": "",
    "базовое_наименование": "Песок, цемент М-500, фибра, пленка",
    "бренд": "",
    "модель": "",
    "тип_материала": "Растворы"
  },
  {
    "главная_категория": "Смеси",
    "подкатегория": "Растворы",
    "артикул_товара": "",
    "полное_наименование_материала": "Раствор цементно-песчаный М150",
    "единица_измерения": "м3",
    "базовая_цена": 9000,
    "ссылка": "",
    "базовое_наименование": "Раствор цементно-песчаный М150",
    "бренд": "",
    "модель": "",
    "тип_материала": "Растворы"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "PIR/XPS",
    "артикул_товара": "",
    "полное_наименование_материала": "XPS CARBON PROF SLOPE (10-60 mm)(4.2 % элемент D)",
    "единица_измерения": "м3",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "XPS CARBON PROF SLOPE (10-60 mm)(4.2 % элемент D)",
    "бренд": "",
    "модель": "",
    "тип_материала": "PIR/XPS"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "PIR/XPS",
    "артикул_товара": "",
    "полное_наименование_материала": "XPS CARBON PROF SLOPE (10-60 mm)(4.2 % элемент J)",
    "единица_измерения": "м3",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "XPS CARBON PROF SLOPE (10-60 mm)(4.2 % элемент J)",
    "бренд": "",
    "модель": "",
    "тип_материала": "PIR/XPS"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "PIR/XPS",
    "артикул_товара": "",
    "полное_наименование_материала": "XPS CARBON PROF SLOPE (10-60 mm)(4.2 % элемент K)",
    "единица_измерения": "м3",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "XPS CARBON PROF SLOPE (10-60 mm)(4.2 % элемент K)",
    "бренд": "",
    "модель": "",
    "тип_материала": "PIR/XPS"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "Устройство утеплителя 100 мм.",
    "артикул_товара": "",
    "полное_наименование_материала": "Клей пена ТН",
    "единица_измерения": "шт",
    "базовая_цена": 660,
    "ссылка": "",
    "базовое_наименование": "Клей пена ТН",
    "бренд": "",
    "модель": "",
    "тип_материала": "Устройство утеплителя 100 мм."
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "PIR/XPS",
    "артикул_товара": "",
    "полное_наименование_материала": "Клиновидный утеплитель ТехноНИКОЛЬ XPS Carbon PROF SLOPE 4,2 % (Доборная плита)",
    "единица_измерения": "м3",
    "базовая_цена": 9300,
    "ссылка": "",
    "базовое_наименование": "Клиновидный утеплитель ТехноНИКОЛЬ XPS Carbon PROF SLOPE 4,2 % (Доборная плита)",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "PIR/XPS"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "PIR/XPS",
    "артикул_товара": "",
    "полное_наименование_материала": "Клиновидный утеплитель ТехноНИКОЛЬ XPS Carbon PROF SLOPE 4,2 % (Элемент J)",
    "единица_измерения": "м3",
    "базовая_цена": 11500,
    "ссылка": "",
    "базовое_наименование": "Клиновидный утеплитель ТехноНИКОЛЬ XPS Carbon PROF SLOPE 4,2 % (Элемент J)",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "PIR/XPS"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "PIR/XPS",
    "артикул_товара": "",
    "полное_наименование_материала": "Клиновидный утеплитель ТехноНИКОЛЬ XPS Carbon PROF SLOPE 4,2 % (Элемент K)",
    "единица_измерения": "м3",
    "базовая_цена": 11500,
    "ссылка": "",
    "базовое_наименование": "Клиновидный утеплитель ТехноНИКОЛЬ XPS Carbon PROF SLOPE 4,2 % (Элемент K)",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "PIR/XPS"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "Минеральная вата",
    "артикул_товара": "",
    "полное_наименование_материала": "Мин. плита Технолайт Экстра 1200х600",
    "единица_измерения": "м3",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Мин. плита Технолайт Экстра 1200х600",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Минеральная вата"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "Минеральная вата",
    "артикул_товара": "",
    "полное_наименование_материала": "Минераловатный утеплитель",
    "единица_измерения": "м2",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Минераловатный утеплитель",
    "бренд": "",
    "модель": "",
    "тип_материала": "Минеральная вата"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "Минеральная вата",
    "артикул_товара": "",
    "полное_наименование_материала": "Минераловатный утеплитель ТехноНИКОЛЬ ТехноРУФ В60",
    "единица_измерения": "м3",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Минераловатный утеплитель ТехноНИКОЛЬ ТехноРУФ В60",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Минеральная вата"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "Минеральная вата",
    "артикул_товара": "",
    "полное_наименование_материала": "Минераловатный утеплитель ТехноНИКОЛЬ ТехноРУФ Н30",
    "единица_измерения": "м3",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Минераловатный утеплитель ТехноНИКОЛЬ ТехноРУФ Н30",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Минеральная вата"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "Минеральная вата",
    "артикул_товара": "",
    "полное_наименование_материала": "Плиты минераловатные ТЕХНОРУФ В ЭКСТРА 1200х600",
    "единица_измерения": "м3",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Плиты минераловатные ТЕХНОРУФ В ЭКСТРА 1200х600",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Минеральная вата"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "Минеральная вата",
    "артикул_товара": "",
    "полное_наименование_материала": "Плиты минераловатные ТЕХНОРУФ Н ПРОФ (3 плиты) 1200х600",
    "единица_измерения": "м3",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Плиты минераловатные ТЕХНОРУФ Н ПРОФ (3 плиты) 1200х600",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Минеральная вата"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "Минеральная вата",
    "артикул_товара": "",
    "полное_наименование_материала": "Теплоизоляционный материал ПИР",
    "единица_измерения": "м2",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Теплоизоляционный материал ПИР",
    "бренд": "",
    "модель": "",
    "тип_материала": "Минеральная вата"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "Минеральная вата",
    "артикул_товара": "",
    "полное_наименование_материала": "Теплоизоляционный материал ТЕХНОРУФ В ЭКСТРА",
    "единица_измерения": "м3",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Теплоизоляционный материал ТЕХНОРУФ В ЭКСТРА",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Минеральная вата"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "PIR/XPS",
    "артикул_товара": "",
    "полное_наименование_материала": "Теплоизоляционный материал ТехноНИКОЛЬ LOGICPIR Ф/Ф",
    "единица_измерения": "м2",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Теплоизоляционный материал ТехноНИКОЛЬ LOGICPIR Ф/Ф",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "PIR/XPS"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "PIR/XPS",
    "артикул_товара": "",
    "полное_наименование_материала": "Экструдированный пенополистирол -",
    "единица_измерения": "м2",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Экструдированный пенополистирол -",
    "бренд": "",
    "модель": "",
    "тип_материала": "PIR/XPS"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "PIR/XPS",
    "артикул_товара": "",
    "полное_наименование_материала": "Экструзионный пенополистирол XPS Carbon",
    "единица_измерения": "мз",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Экструзионный пенополистирол XPS Carbon",
    "бренд": "",
    "модель": "",
    "тип_материала": "PIR/XPS"
  },
  {
    "главная_категория": "Теплоизоляция",
    "подкатегория": "PIR/XPS",
    "артикул_товара": "",
    "полное_наименование_материала": "Экструзионный пенополистирол XPS Carbon Prof",
    "единица_измерения": "мз",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Экструзионный пенополистирол XPS Carbon Prof",
    "бренд": "",
    "модель": "",
    "тип_материала": "PIR/XPS"
  },
  {
    "главная_категория": "Химия",
    "подкатегория": "Герметики и праймеры",
    "артикул_товара": "",
    "полное_наименование_материала": "Герметик ТЕХНОНИКОЛЬ ПУ MASTER, серый, туба 600 мл",
    "единица_измерения": "шт",
    "базовая_цена": 444.7,
    "ссылка": "",
    "базовое_наименование": "Герметик ТЕХНОНИКОЛЬ ПУ MASTER, серый, туба 600 мл",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Герметики и праймеры"
  },
  {
    "главная_категория": "Химия",
    "подкатегория": "Герметики и праймеры",
    "артикул_товара": "",
    "полное_наименование_материала": "Герметик полиуретановый ТехноНИКОЛЬ, 600мм",
    "единица_измерения": "шт",
    "базовая_цена": 520,
    "ссылка": "",
    "базовое_наименование": "Герметик полиуретановый ТехноНИКОЛЬ, 600мм",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Герметики и праймеры"
  },
  {
    "главная_категория": "Химия",
    "подкатегория": "Герметики и праймеры",
    "артикул_товара": "",
    "полное_наименование_материала": "Мастика Технониколь № 71",
    "единица_измерения": "шт",
    "базовая_цена": 820,
    "ссылка": "",
    "базовое_наименование": "Мастика Технониколь № 71",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Герметики и праймеры"
  },
  {
    "главная_категория": "Химия",
    "подкатегория": "Герметики и праймеры",
    "артикул_товара": "",
    "полное_наименование_материала": "Очиститель для ПВХ, 3 л.",
    "единица_измерения": "шт",
    "базовая_цена": 0,
    "ссылка": "",
    "базовое_наименование": "Очиститель для ПВХ, 3 л.",
    "бренд": "",
    "модель": "",
    "тип_материала": "Герметики и праймеры"
  },
  {
    "главная_категория": "Химия",
    "подкатегория": "Герметики и праймеры",
    "артикул_товара": "",
    "полное_наименование_материала": "ПУ герметик",
    "единица_измерения": "шт",
    "базовая_цена": 449.4,
    "ссылка": "",
    "базовое_наименование": "ПУ герметик",
    "бренд": "",
    "модель": "",
    "тип_материала": "Герметики и праймеры"
  },
  {
    "главная_категория": "Химия",
    "подкатегория": "Герметики и праймеры",
    "артикул_товара": "",
    "полное_наименование_материала": "Праймер ТехноНиколь 01, 20 л",
    "единица_измерения": "шт",
    "базовая_цена": 4715.55,
    "ссылка": "",
    "базовое_наименование": "Праймер ТехноНиколь 01, 20 л",
    "бренд": "ТехноНИКОЛЬ",
    "модель": "",
    "тип_материала": "Герметики и праймеры"
  }
]

export const realMaterialVariantsFromUploadedEstimates = [
  {
    "base_key": "xps carbon prof slope (10-60 mm)(4.2 % элемент d)",
    "артикул_товара": "",
    "полное_наименование_варианта": "XPS CARBON PROF SLOPE (10-60 mm)(4.2 % элемент D), 50 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 50,
    "единица_варианта": "мм",
    "label_варианта": "50 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "анкерный элемент termoclip 8*",
    "артикул_товара": "",
    "полное_наименование_варианта": "Анкерный элемент TERMOCLIP 8*45мм",
    "тип_варианта": "толщина",
    "значение_варианта": 45,
    "единица_варианта": "мм",
    "label_варианта": "45 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "анкерный элемент termoclip 8* (2500шт/кор)",
    "артикул_товара": "",
    "полное_наименование_варианта": "Анкерный элемент TERMOCLIP 8*45мм (2500шт/кор)",
    "тип_варианта": "толщина",
    "значение_варианта": 45,
    "единица_варианта": "мм",
    "label_варианта": "45 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "армированная пвх мембрана ecoplast v-rp",
    "артикул_товара": "",
    "полное_наименование_варианта": "Армированная ПВХ мембрана Ecoplast V-RP толщиной 1,5 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 1.5,
    "единица_варианта": "мм",
    "label_варианта": "1.5 мм",
    "базовая_цена": 1280,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "армированная пвх мембрана logicroof v-rp (или аналог)",
    "артикул_товара": "",
    "полное_наименование_варианта": "Армированная ПВХ мембрана Logicroof V-RP (или аналог) толщиной 1,2 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 1.2,
    "единица_варианта": "мм",
    "label_варианта": "1.2 мм",
    "базовая_цена": 931,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "армированная пвх мембрана logicroof v-rp (или аналог)",
    "артикул_товара": "",
    "полное_наименование_варианта": "Армированная ПВХ мембрана Logicroof V-RP (или аналог) толщиной 1,5 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 1.5,
    "единица_варианта": "мм",
    "label_варианта": "1.5 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "изделие (l-образный профиль) из оц. стали",
    "артикул_товара": "",
    "полное_наименование_варианта": "Изделие (L-образный профиль) из оц. стали толщиной 0,5 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 0.5,
    "единица_варианта": "мм",
    "label_варианта": "0.5 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "изделие (l-образный профиль, коньковый усилитель) из оц. стали",
    "артикул_товара": "",
    "полное_наименование_варианта": "Изделие (L-образный профиль, коньковый усилитель) из оц. стали толщиной 0,5 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 0.5,
    "единица_варианта": "мм",
    "label_варианта": "0.5 мм",
    "базовая_цена": 525,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "изделие из оц. стали 600*600 мм",
    "артикул_товара": "",
    "полное_наименование_варианта": "Изделие из оц. стали 600*600 мм, толщиной 0,5 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 0.5,
    "единица_варианта": "мм",
    "label_варианта": "0.5 мм",
    "базовая_цена": 1400,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "мин. плита технолайт экстра 1200х600",
    "артикул_товара": "",
    "полное_наименование_варианта": "Мин. плита Технолайт Экстра 1200х600х100мм",
    "тип_варианта": "толщина",
    "значение_варианта": 100,
    "единица_варианта": "мм",
    "label_варианта": "100 мм",
    "базовая_цена": 3700,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "минераловатный утеплитель",
    "артикул_товара": "",
    "полное_наименование_варианта": "Минераловатный утеплитель 100 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 100,
    "единица_варианта": "мм",
    "label_варианта": "100 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "минераловатный утеплитель технониколь техноруф в60",
    "артикул_товара": "",
    "полное_наименование_варианта": "Минераловатный утеплитель ТехноНИКОЛЬ ТехноРУФ В60, толщиной 40 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 40,
    "единица_варианта": "мм",
    "label_варианта": "40 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "минераловатный утеплитель технониколь техноруф н30",
    "артикул_товара": "",
    "полное_наименование_варианта": "Минераловатный утеплитель ТехноНИКОЛЬ ТехноРУФ Н30, толщиной 80 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 80,
    "единица_варианта": "мм",
    "label_варианта": "80 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "неармированная пвх мембрана v-sr",
    "артикул_товара": "",
    "полное_наименование_варианта": "Неармированная ПВХ мембрана V-SR толщиной 1,5 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 1.5,
    "единица_варианта": "мм",
    "label_варианта": "1.5 мм",
    "базовая_цена": 1500,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "неармированная пвх-мембрана технониколь logicroof v-sr",
    "артикул_товара": "",
    "полное_наименование_варианта": "Неармированная ПВХ-мембрана ТехноНИКОЛЬ LOGICROOF V-SR 1,5 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 1.5,
    "единица_варианта": "мм",
    "label_варианта": "1.5 мм",
    "базовая_цена": 1100,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "пвх logicroof v-rp мембрана серая 2,10x25 м",
    "артикул_товара": "",
    "полное_наименование_варианта": "ПВХ Logicroof V-RP 1,2 мм мембрана серая 2,10x25 м",
    "тип_варианта": "толщина",
    "значение_варианта": 1.2,
    "единица_варианта": "мм",
    "label_варианта": "1.2 мм",
    "базовая_цена": 931,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "пвх logicroof v-sr мембрана серая 2 шт. 1x10 м",
    "артикул_товара": "",
    "полное_наименование_варианта": "ПВХ Logicroof V-SR 1,5 мм мембрана серая 2 шт. 1x10 м",
    "тип_варианта": "толщина",
    "значение_варианта": 1.5,
    "единица_варианта": "мм",
    "label_варианта": "1.5 мм",
    "базовая_цена": 1350,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "пвх мембрана.",
    "артикул_товара": "",
    "полное_наименование_варианта": "ПВХ мембрана, толщиной 1,2 мм.",
    "тип_варианта": "толщина",
    "значение_варианта": 1.2,
    "единица_варианта": "мм",
    "label_варианта": "1.2 мм",
    "базовая_цена": 931,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "пвх мембрана.",
    "артикул_товара": "",
    "полное_наименование_варианта": "ПВХ мембрана, толщиной 1,5 мм.",
    "тип_варианта": "толщина",
    "значение_варианта": 1.5,
    "единица_варианта": "мм",
    "label_варианта": "1.5 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "пвх-мембрана технониколь logicroof v-rp",
    "артикул_товара": "",
    "полное_наименование_варианта": "ПВХ-мембрана ТехноНИКОЛЬ LogicROOF V-RP 1,5 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 1.5,
    "единица_варианта": "мм",
    "label_варианта": "1.5 мм",
    "базовая_цена": 1167,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "плиты минераловатные техноруф в экстра 1200х600",
    "артикул_товара": "",
    "полное_наименование_варианта": "Плиты минераловатные ТЕХНОРУФ В ЭКСТРА 1200х600х50 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 50,
    "единица_варианта": "мм",
    "label_варианта": "50 мм",
    "базовая_цена": 16112,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "плиты минераловатные техноруф н проф (3 плиты) 1200х600",
    "артикул_товара": "",
    "полное_наименование_варианта": "Плиты минераловатные ТЕХНОРУФ Н ПРОФ (3 плиты) 1200х600х100 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 100,
    "единица_варианта": "мм",
    "label_варианта": "100 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "саморез сверлоконечный termoclip 4,8х",
    "артикул_товара": "",
    "полное_наименование_варианта": "Саморез сверлоконечный TERMOCLIP 4,8х 100 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 100,
    "единица_варианта": "мм",
    "label_варианта": "100 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "телескопический крепеж termoclip 1",
    "артикул_товара": "",
    "полное_наименование_варианта": "Телескопический крепеж TERMOCLIP 1, 100 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 100,
    "единица_варианта": "мм",
    "label_варианта": "100 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "телескопический крепеж termoclip 1",
    "артикул_товара": "",
    "полное_наименование_варианта": "Телескопический крепеж TERMOCLIP 1, 130 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 130,
    "единица_варианта": "мм",
    "label_варианта": "130 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "телескопический крепеж termoclip 1",
    "артикул_товара": "",
    "полное_наименование_варианта": "Телескопический крепеж TERMOCLIP 1, 140 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 140,
    "единица_варианта": "мм",
    "label_варианта": "140 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "телескопический крепеж termoclip 1",
    "артикул_товара": "",
    "полное_наименование_варианта": "Телескопический крепеж TERMOCLIP 1, 150 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 150,
    "единица_варианта": "мм",
    "label_варианта": "150 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "телескопический крепеж termoclip 1",
    "артикул_товара": "",
    "полное_наименование_варианта": "Телескопический крепеж TERMOCLIP 1, 180 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 180,
    "единица_варианта": "мм",
    "label_варианта": "180 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "телескопический крепеж termoclip 1",
    "артикул_товара": "",
    "полное_наименование_варианта": "Телескопический крепеж TERMOCLIP 1, 20 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 20,
    "единица_варианта": "мм",
    "label_варианта": "20 мм",
    "базовая_цена": 8.73,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "телескопический крепеж termoclip 1",
    "артикул_товара": "",
    "полное_наименование_варианта": "Телескопический крепеж TERMOCLIP 1, 200 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 200,
    "единица_варианта": "мм",
    "label_варианта": "200 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "телескопический крепеж termoclip 1",
    "артикул_товара": "",
    "полное_наименование_варианта": "Телескопический крепеж TERMOCLIP 1, 60 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 60,
    "единица_варианта": "мм",
    "label_варианта": "60 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "телескопический крепеж termoclip 1",
    "артикул_товара": "",
    "полное_наименование_варианта": "Телескопический крепеж TERMOCLIP 1, 80 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 80,
    "единица_варианта": "мм",
    "label_варианта": "80 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "теплоизоляционный материал пир",
    "артикул_товара": "",
    "полное_наименование_варианта": "Теплоизоляционный материал ПИР 40 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 40,
    "единица_варианта": "мм",
    "label_варианта": "40 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "теплоизоляционный материал технониколь logicpir ф/ф",
    "артикул_товара": "",
    "полное_наименование_варианта": "Теплоизоляционный материал ТехноНИКОЛЬ LOGICPIR Ф/Ф 80 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 80,
    "единица_варианта": "мм",
    "label_варианта": "80 мм",
    "базовая_цена": 2000,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "теплоизоляционный материал техноруф в экстра",
    "артикул_товара": "",
    "полное_наименование_варианта": "Теплоизоляционный материал ТЕХНОРУФ В ЭКСТРА 50 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 50,
    "единица_варианта": "мм",
    "label_варианта": "50 мм",
    "базовая_цена": 16112,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "фасонное изделие из оц. стали",
    "артикул_товара": "",
    "полное_наименование_варианта": "Фасонное изделие из оц. стали толщиной 0,5 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 0.5,
    "единица_варианта": "мм",
    "label_варианта": "0.5 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "экструдированный пенополистирол -",
    "артикул_товара": "",
    "полное_наименование_варианта": "Экструдированный пенополистирол - 50 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 50,
    "единица_варианта": "мм",
    "label_варианта": "50 мм",
    "базовая_цена": 0,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "экструзионный пенополистирол xps carbon",
    "артикул_товара": "",
    "полное_наименование_варианта": "Экструзионный пенополистирол XPS Carbon 50 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 50,
    "единица_варианта": "мм",
    "label_варианта": "50 мм",
    "базовая_цена": 8800,
    "ссылка": "",
    "активен": 1
  },
  {
    "base_key": "экструзионный пенополистирол xps carbon prof",
    "артикул_товара": "",
    "полное_наименование_варианта": "Экструзионный пенополистирол XPS Carbon Prof 50 мм",
    "тип_варианта": "толщина",
    "значение_варианта": 50,
    "единица_варианта": "мм",
    "label_варианта": "50 мм",
    "базовая_цена": 10000,
    "ссылка": "",
    "активен": 1
  }
]

export async function seedUploadedEstimatesRealData(db) {
  for (const work of realWorksFromUploadedEstimates) {
    const exists = await db.select(
      'SELECT идентификатор FROM Справочник_видов_работ WHERE наименование_работы = $1 LIMIT 1',
      [work.наименование_работы]
    )

    if (exists.length === 0) {
      await db.execute(
        `INSERT INTO Справочник_видов_работ (
          категория_работы,
          наименование_работы,
          единица_измерения_работы,
          цена_0_300,
          цена_300_600,
          цена_600_1000,
          цена_1000_3000,
          цена_3000_6000,
          цена_6000_15000,
          цена_15000_30000,
          цена_более_30000
        ) VALUES ($1,$2,$3,$4,$5,$6,$7,$8,$9,$10,$11)`,
        [
          work.категория_работы,
          work.наименование_работы,
          work.единица_измерения_работы,
          work.цена_0_300,
          work.цена_300_600,
          work.цена_600_1000,
          work.цена_1000_3000,
          work.цена_3000_6000,
          work.цена_6000_15000,
          work.цена_15000_30000,
          work.цена_более_30000
        ]
      )
    } else {
      await db.execute(
        `UPDATE Справочник_видов_работ SET
          категория_работы = $1,
          единица_измерения_работы = $2,
          цена_0_300 = $3,
          цена_300_600 = $4,
          цена_600_1000 = $5,
          цена_1000_3000 = $6,
          цена_3000_6000 = $7,
          цена_6000_15000 = $8,
          цена_15000_30000 = $9,
          цена_более_30000 = $10
         WHERE наименование_работы = $11`,
        [
          work.категория_работы,
          work.единица_измерения_работы,
          work.цена_0_300,
          work.цена_300_600,
          work.цена_600_1000,
          work.цена_1000_3000,
          work.цена_3000_6000,
          work.цена_6000_15000,
          work.цена_15000_30000,
          work.цена_более_30000,
          work.наименование_работы
        ]
      )
    }
  }

  const materialIdMap = new Map()

  for (const material of realBaseMaterialsFromUploadedEstimates) {
    const exists = await db.select(
      'SELECT идентификатор FROM Справочник_материалов WHERE lower(полное_наименование_материала) = lower($1) LIMIT 1',
      [material.полное_наименование_материала]
    )

    if (exists.length === 0) {
      await db.execute(
        `INSERT INTO Справочник_материалов (
          главная_категория,
          подкатегория,
          артикул_товара,
          полное_наименование_материала,
          единица_измерения,
          базовая_цена,
          ссылка,
          базовое_наименование,
          бренд,
          модель,
          тип_материала
        ) VALUES ($1,$2,$3,$4,$5,$6,$7,$8,$9,$10,$11)`,
        [
          material.главная_категория,
          material.подкатегория,
          material.артикул_товара,
          material.полное_наименование_материала,
          material.единица_измерения,
          material.базовая_цена,
          material.ссылка,
          material.базовое_наименование,
          material.бренд,
          material.модель,
          material.тип_материала
        ]
      )
    } else {
      await db.execute(
        `UPDATE Справочник_материалов SET
          главная_категория = $1,
          подкатегория = $2,
          артикул_товара = $3,
          единица_измерения = $4,
          базовая_цена = $5,
          ссылка = $6,
          базовое_наименование = $7,
          бренд = $8,
          модель = $9,
          тип_материала = $10
         WHERE lower(полное_наименование_материала) = lower($11)`,
        [
          material.главная_категория,
          material.подкатегория,
          material.артикул_товара,
          material.единица_измерения,
          material.базовая_цена,
          material.ссылка,
          material.базовое_наименование,
          material.бренд,
          material.модель,
          material.тип_материала,
          material.полное_наименование_материала
        ]
      )
    }

    const row = await db.select(
      'SELECT идентификатор FROM Справочник_материалов WHERE lower(полное_наименование_материала) = lower($1) LIMIT 1',
      [material.полное_наименование_материала]
    )

    if (row.length > 0) {
      materialIdMap.set(normalizeKey(material.полное_наименование_материала), row[0].идентификатор)
      materialIdMap.set(normalizeKey(material.базовое_наименование), row[0].идентификатор)
    }
  }

  for (const variant of realMaterialVariantsFromUploadedEstimates) {
    const materialId = materialIdMap.get(variant.base_key)
    if (!materialId) continue

    const exists = await db.select(
      `SELECT идентификатор
       FROM Справочник_вариантов_материалов
       WHERE material_id = $1 AND label_варианта = $2
       LIMIT 1`,
      [materialId, variant.label_варианта]
    )

    if (exists.length === 0) {
      await db.execute(
        `INSERT INTO Справочник_вариантов_материалов (
          material_id,
          артикул_товара,
          полное_наименование_варианта,
          тип_варианта,
          значение_варианта,
          единица_варианта,
          label_варианта,
          базовая_цена,
          ссылка,
          активен
        ) VALUES ($1,$2,$3,$4,$5,$6,$7,$8,$9,$10)`,
        [
          materialId,
          variant.артикул_товара,
          variant.полное_наименование_варианта,
          variant.тип_варианта,
          variant.значение_варианта,
          variant.единица_варианта,
          variant.label_варианта,
          variant.базовая_цена,
          variant.ссылка,
          variant.активен
        ]
      )
    } else {
      await db.execute(
        `UPDATE Справочник_вариантов_материалов SET
          артикул_товара = $1,
          полное_наименование_варианта = $2,
          тип_варианта = $3,
          значение_варианта = $4,
          единица_варианта = $5,
          базовая_цена = $6,
          ссылка = $7,
          активен = $8
         WHERE material_id = $9 AND label_варианта = $10`,
        [
          variant.артикул_товара,
          variant.полное_наименование_варианта,
          variant.тип_варианта,
          variant.значение_варианта,
          variant.единица_варианта,
          variant.базовая_цена,
          variant.ссылка,
          variant.активен,
          materialId,
          variant.label_варианта
        ]
      )
    }
  }
}

function normalizeKey(value) {
  return `${value || ''}`.toLowerCase().replace(/\s+/g, ' ').trim()
}


const materialRules = [
  {
    key: 'paro-film',
    test: [/пароизоляц/i, /паробарьер/i],
    главная_категория: 'Пароизоляция',
    подкатегория: 'Пленки',
    базовое_наименование: 'Пленка пароизоляционная',
    бренд: 'ТехноНИКОЛЬ',
    модель: '',
    тип_материала: 'Пароизоляция'
  },
  {
    key: 'double-tape',
    test: [/двусторонн.*скотч/i, /скотч.*двусторон/i],
    главная_категория: 'Пароизоляция',
    подкатегория: 'Расходники',
    базовое_наименование: 'Скотч двусторонний',
    бренд: '',
    модель: '',
    тип_материала: 'Скотч'
  },
  {
    key: 'logicpir',
    test: [/logicpir/i, /\bпир\b/i],
    главная_категория: 'Теплоизоляция',
    подкатегория: 'PIR',
    базовое_наименование: 'Теплоизоляционный материал LOGICPIR',
    бренд: 'ТехноНИКОЛЬ',
    модель: 'Ф/Ф',
    тип_материала: 'PIR'
  },
  {
    key: 'minwool',
    test: [/минераловат/i, /техноруф/i, /технолайт/i],
    главная_категория: 'Теплоизоляция',
    подкатегория: 'Минераловатный утеплитель',
    базовое_наименование: 'Минераловатный утеплитель',
    бренд: 'ТехноНИКОЛЬ',
    модель: '',
    тип_материала: 'Минвата'
  },
  {
    key: 'xps',
    test: [/экструдированн/i, /экструзионн/i, /\bxps\b/i, /xps carbon/i],
    главная_категория: 'Теплоизоляция',
    подкатегория: 'XPS',
    базовое_наименование: 'Экструдированный пенополистирол',
    бренд: 'ТехноНИКОЛЬ',
    модель: '',
    тип_материала: 'XPS'
  },
  {
    key: 'pvc-vrp',
    test: [/v-rp/i, /ecoplast/i, /logicroof v-rp/i],
    главная_категория: 'ПВХ мембраны',
    подкатегория: 'Основное покрытие',
    базовое_наименование: 'ПВХ мембрана V-RP',
    бренд: 'ТехноНИКОЛЬ',
    модель: 'V-RP',
    тип_материала: 'ПВХ мембрана'
  },
  {
    key: 'pvc-vsr',
    test: [/v-sr/i, /logicroof v-sr/i],
    главная_категория: 'ПВХ мембраны',
    подкатегория: 'Комплектующие',
    базовое_наименование: 'ПВХ мембрана V-SR',
    бренд: 'ТехноНИКОЛЬ',
    модель: 'V-SR',
    тип_материала: 'ПВХ мембрана'
  },
  {
    key: 'pvc-walkway',
    test: [/walkway/i, /дорожк/i],
    главная_категория: 'ПВХ мембраны',
    подкатегория: 'Эксплуатируемые элементы',
    базовое_наименование: 'ПВХ дорожка Walkway Puzzle',
    бренд: 'ТехноНИКОЛЬ',
    модель: 'Walkway Puzzle',
    тип_материала: 'ПВХ дорожка'
  },
  {
    key: 'pvc-cleaner',
    test: [/очистител.*пвх/i],
    главная_категория: 'ПВХ мембраны',
    подкатегория: 'Расходники',
    базовое_наименование: 'Очиститель для ПВХ мембран',
    бренд: '',
    модель: '',
    тип_материала: 'Очиститель'
  },
  {
    key: 'pvc-metal',
    test: [/пвх.*металл/i, /пвх-металл/i],
    главная_категория: 'Доборные элементы',
    подкатегория: 'ПВХ-металл',
    базовое_наименование: 'ПВХ-металл',
    бренд: '',
    модель: '',
    тип_материала: 'ПВХ-металл'
  },
  {
    key: 'edge-rail',
    test: [/краев.*планк/i, /рейка краева/i],
    главная_категория: 'Доборные элементы',
    подкатегория: 'Планки',
    базовое_наименование: 'Рейка краевая',
    бренд: '',
    модель: '',
    тип_материала: 'Планка'
  },
  {
    key: 'press-rail',
    test: [/прижимн.*планк/i, /прижимн.*рейк/i, /рейка прижим/i],
    главная_категория: 'Доборные элементы',
    подкатегория: 'Планки',
    базовое_наименование: 'Рейка прижимная',
    бренд: '',
    модель: '',
    тип_материала: 'Планка'
  },
  {
    key: 'l-profile',
    test: [/l-образн/i, /l образн/i],
    главная_категория: 'Доборные элементы',
    подкатегория: 'Профили усиления',
    базовое_наименование: 'L-образный профиль',
    бренд: '',
    модель: '',
    тип_материала: 'Профиль'
  },
  {
    key: 'ridge-profile',
    test: [/коньков.*усил/i, /профиль усиления \(коньковые/i],
    главная_категория: 'Доборные элементы',
    подкатегория: 'Профили усиления',
    базовое_наименование: 'Профиль усиления',
    бренд: '',
    модель: '',
    тип_материала: 'Профиль'
  },
  {
    key: 'joint-profile',
    test: [/деф\.?\s*шва/i, /деформац.*шва/i],
    главная_категория: 'Доборные элементы',
    подкатегория: 'Профили усиления',
    базовое_наименование: 'Профиль усиления деф. шва',
    бренд: '',
    модель: '',
    тип_материала: 'Профиль'
  },
  {
    key: 'galv-600x600',
    test: [/600\*600/i, /600x600/i, /600×600/i],
    главная_категория: 'Металл',
    подкатегория: 'Усиление воронок',
    базовое_наименование: 'Изделие из оцинкованной стали 600×600',
    бренд: '',
    модель: '',
    тип_материала: 'Металл'
  },
  {
    key: 'fastener-telescope',
    test: [/телескопическ.*крепеж/i, /termoclip 1/i, /крепеж кровельный телескопический/i],
    главная_категория: 'Крепеж',
    подкатегория: 'Телескопический крепеж',
    базовое_наименование: 'Телескопический крепеж',
    бренд: 'ТехноНИКОЛЬ',
    модель: 'TERMOCLIP',
    тип_материала: 'Крепеж'
  },
  {
    key: 'anchor',
    test: [/анкерн.*элемент/i],
    главная_категория: 'Крепеж',
    подкатегория: 'Анкеры',
    базовое_наименование: 'Анкерный элемент',
    бренд: '',
    модель: '',
    тип_материала: 'Анкер'
  },
  {
    key: 'washer',
    test: [/шайба/i],
    главная_категория: 'Крепеж',
    подкатегория: 'Кровельные шайбы',
    базовое_наименование: 'Кровельная шайба',
    бренд: '',
    модель: '',
    тип_материала: 'Шайба'
  },
  {
    key: 'screw',
    test: [/саморез/i],
    главная_категория: 'Крепеж',
    подкатегория: 'Кровельный крепеж',
    базовое_наименование: 'Саморез кровельный',
    бренд: '',
    модель: '',
    тип_материала: 'Саморез'
  },
  {
    key: 'fastener-planki',
    test: [/крепеж кровельный технониколь \(саморез 5,5\*35\)/i],
    главная_категория: 'Крепеж',
    подкатегория: 'Крепеж для планок',
    базовое_наименование: 'Крепеж для планок',
    бренд: 'ТехноНИКОЛЬ',
    модель: '',
    тип_материала: 'Крепеж'
  },
  {
    key: 'sealant',
    test: [/герметик/i],
    главная_категория: 'Герметики',
    подкатегория: 'Полиуретановые герметики',
    базовое_наименование: 'Герметик полиуретановый',
    бренд: 'ТехноНИКОЛЬ',
    модель: '',
    тип_материала: 'Герметик'
  },
  {
    key: 'primer',
    test: [/праймер/i],
    главная_категория: 'БРМ',
    подкатегория: 'Праймер',
    базовое_наименование: 'Праймер битумный',
    бренд: 'ТехноНИКОЛЬ',
    модель: '',
    тип_материала: 'Праймер'
  },
  {
    key: 'uniflex-epp',
    test: [/унифлекс эпп/i],
    главная_категория: 'БРМ',
    подкатегория: 'Рулонные материалы',
    базовое_наименование: 'Унифлекс ЭПП',
    бренд: 'ТехноНИКОЛЬ',
    модель: 'ЭПП',
    тип_материала: 'БРМ'
  },
  {
    key: 'uniflex-ekp',
    test: [/унифлекс экп/i],
    главная_категория: 'БРМ',
    подкатегория: 'Рулонные материалы',
    базовое_наименование: 'Унифлекс ЭКП',
    бренд: 'ТехноНИКОЛЬ',
    модель: 'ЭКП',
    тип_материала: 'БРМ'
  },
  {
    key: 'bipol',
    test: [/биполь/i],
    главная_категория: 'БРМ',
    подкатегория: 'Рулонные материалы',
    базовое_наименование: 'Биполь ЭПП',
    бренд: 'ТехноНИКОЛЬ',
    модель: 'ЭПП',
    тип_материала: 'БРМ'
  },
  {
    key: 'aerator',
    test: [/аэратор/i],
    главная_категория: 'Доборные элементы',
    подкатегория: 'Аэраторы',
    базовое_наименование: 'Кровельный аэратор',
    бренд: '',
    модель: '',
    тип_материала: 'Аэратор'
  },
  {
    key: 'drain-roof',
    test: [/воронка кровельная/i, /вфо/i],
    главная_категория: 'Водоотведение',
    подкатегория: 'Внутренние воронки',
    базовое_наименование: 'Воронка кровельная',
    бренд: '',
    модель: '',
    тип_материала: 'Воронка'
  },
  {
    key: 'drain-parapet',
    test: [/воронка парапет/i],
    главная_категория: 'Водоотведение',
    подкатегория: 'Парапетные воронки',
    базовое_наименование: 'Воронка парапетная',
    бренд: '',
    модель: '',
    тип_материала: 'Воронка'
  },
  {
    key: 'drain-outlet',
    test: [/воронка выпускн/i],
    главная_категория: 'Водоотведение',
    подкатегория: 'Выпуски',
    базовое_наименование: 'Воронка выпускная',
    бренд: '',
    модель: '',
    тип_материала: 'Воронка'
  }
]

const workNameMap = {
  'Устройство пароизоляционного слоя из пленки': 'Устройство пароизоляционного слоя из пленки',
  'Устройство пароизоляционного слоя из пароизоляционной пленки': 'Устройство пароизоляционного слоя из пленки',
  'Монтаж гидроизоляционного покрытия из ПВХ мембраны с продольным нахлестом 120мм и поперечным 200мм.': 'Монтаж гидроизоляционного покрытия из ПВХ мембраны',
  'Монтаж гидроизоляционного покрытия из ПВХ мембраны, с продольным нахлестом не менее 120 мм и поперечным - не менее 200 мм': 'Монтаж гидроизоляционного покрытия из ПВХ мембраны',
  'Монтаж гидроизоляционного покрытия из ПВХ мембраны, с шириной рулона 2 м, с продольным нахлестом не менее 120мм и поперечным 200мм': 'Монтаж гидроизоляционного покрытия из ПВХ мембраны',
  'Монтаж гидроизоляционного покрытия из ПВХ мембраны, с шириной рулона 0.5-1 м, с продольным нахлестом не менее 120мм и поперечным 200мм': 'Монтаж гидроизоляционного покрытия из ПВХ мембраны',
  'Устройство комбинированного утеплителя (Минераловатный утеплитель 100 мм + экструдированный пенополистирол - 50 мм) 2 слоя с разбежкой швов, с общей толщиной 150 мм': 'Устройство комбинированного теплоизоляционного слоя',
  'Устройство комбинированного теплоизоляционного слоя (Мин. Вата + ПИР) в два слоя с перехлестом швов, общей толщиной 100 мм': 'Устройство комбинированного теплоизоляционного слоя',
  'Монтаж гидроизоляционного покрытия из полимеро-битумного наплавляемого материала в 2 слоя': 'Монтаж битумно-полимерного кровельного ковра в 2 слоя'
}

export const normalizedWorksFromUploadedEstimates = normalizeWorks(realWorksFromUploadedEstimates)

const normalizedMaterialPayload = normalizeMaterialsAndVariants(
  realBaseMaterialsFromUploadedEstimates,
  realMaterialVariantsFromUploadedEstimates
)

export const normalizedBaseMaterialsFromUploadedEstimates = normalizedMaterialPayload.baseMaterials
export const normalizedMaterialVariantsFromUploadedEstimates = normalizedMaterialPayload.variants

export async function seedNormalizedUploadedEstimatesData(db) {
  for (const work of normalizedWorksFromUploadedEstimates) {
    const exists = await db.select(
      'SELECT идентификатор FROM Справочник_видов_работ WHERE наименование_работы = $1 LIMIT 1',
      [work.наименование_работы]
    )

    if (exists.length === 0) {
      await db.execute(
        `INSERT INTO Справочник_видов_работ (
          категория_работы,
          наименование_работы,
          единица_измерения_работы,
          цена_0_300,
          цена_300_600,
          цена_600_1000,
          цена_1000_3000,
          цена_3000_6000,
          цена_6000_15000,
          цена_15000_30000,
          цена_более_30000
        ) VALUES ($1,$2,$3,$4,$5,$6,$7,$8,$9,$10,$11)`,
        [
          work.категория_работы,
          work.наименование_работы,
          work.единица_измерения_работы,
          work.цена_0_300,
          work.цена_300_600,
          work.цена_600_1000,
          work.цена_1000_3000,
          work.цена_3000_6000,
          work.цена_6000_15000,
          work.цена_15000_30000,
          work.цена_более_30000
        ]
      )
    } else {
      await db.execute(
        `UPDATE Справочник_видов_работ SET
          категория_работы = $1,
          единица_измерения_работы = $2,
          цена_0_300 = $3,
          цена_300_600 = $4,
          цена_600_1000 = $5,
          цена_1000_3000 = $6,
          цена_3000_6000 = $7,
          цена_6000_15000 = $8,
          цена_15000_30000 = $9,
          цена_более_30000 = $10
         WHERE наименование_работы = $11`,
        [
          work.категория_работы,
          work.единица_измерения_работы,
          work.цена_0_300,
          work.цена_300_600,
          work.цена_600_1000,
          work.цена_1000_3000,
          work.цена_3000_6000,
          work.цена_6000_15000,
          work.цена_15000_30000,
          work.цена_более_30000,
          work.наименование_работы
        ]
      )
    }
  }

  const materialIdMap = new Map()

  for (const material of normalizedBaseMaterialsFromUploadedEstimates) {
    const exists = await db.select(
      `SELECT идентификатор
       FROM Справочник_материалов
       WHERE lower(базовое_наименование) = lower($1)
       LIMIT 1`,
      [material.базовое_наименование]
    )

    if (exists.length === 0) {
      await db.execute(
        `INSERT INTO Справочник_материалов (
          главная_категория,
          подкатегория,
          артикул_товара,
          полное_наименование_материала,
          единица_измерения,
          базовая_цена,
          ссылка,
          базовое_наименование,
          бренд,
          модель,
          тип_материала
        ) VALUES ($1,$2,$3,$4,$5,$6,$7,$8,$9,$10,$11)`,
        [
          material.главная_категория,
          material.подкатегория,
          material.артикул_товара,
          material.полное_наименование_материала,
          material.единица_измерения,
          material.базовая_цена,
          material.ссылка,
          material.базовое_наименование,
          material.бренд,
          material.модель,
          material.тип_материала
        ]
      )

      const inserted = await db.select(
        `SELECT идентификатор
         FROM Справочник_материалов
         WHERE lower(базовое_наименование) = lower($1)
         LIMIT 1`,
        [material.базовое_наименование]
      )

      if (inserted.length > 0) {
        materialIdMap.set(material.base_key, inserted[0].идентификатор)
      }
    } else {
      materialIdMap.set(material.base_key, exists[0].идентификатор)

      await db.execute(
        `UPDATE Справочник_материалов SET
          главная_категория = $1,
          подкатегория = $2,
          единица_измерения = $3,
          базовая_цена = $4,
          базовое_наименование = $5,
          бренд = $6,
          модель = $7,
          тип_материала = $8
         WHERE идентификатор = $9`,
        [
          material.главная_категория,
          material.подкатегория,
          material.единица_измерения,
          material.базовая_цена,
          material.базовое_наименование,
          material.бренд,
          material.модель,
          material.тип_материала,
          exists[0].идентификатор
        ]
      )
    }
  }

  for (const variant of normalizedMaterialVariantsFromUploadedEstimates) {
    const materialId = materialIdMap.get(variant.base_key)
    if (!materialId) continue

    const exists = await db.select(
      `SELECT идентификатор
       FROM Справочник_вариантов_материалов
       WHERE material_id = $1 AND label_варианта = $2
       LIMIT 1`,
      [materialId, variant.label_варианта]
    )

    if (exists.length === 0) {
      await db.execute(
        `INSERT INTO Справочник_вариантов_материалов (
          material_id,
          артикул_товара,
          полное_наименование_варианта,
          тип_варианта,
          значение_варианта,
          единица_варианта,
          label_варианта,
          базовая_цена,
          ссылка,
          активен
        ) VALUES ($1,$2,$3,$4,$5,$6,$7,$8,$9,$10)`,
        [
          materialId,
          variant.артикул_товара,
          variant.полное_наименование_варианта,
          variant.тип_варианта,
          variant.значение_варианта,
          variant.единица_варианта,
          variant.label_варианта,
          variant.базовая_цена,
          variant.ссылка,
          variant.активен
        ]
      )
    } else {
      await db.execute(
        `UPDATE Справочник_вариантов_материалов SET
          артикул_товара = $1,
          полное_наименование_варианта = $2,
          тип_варианта = $3,
          значение_варианта = $4,
          единица_варианта = $5,
          базовая_цена = $6,
          ссылка = $7,
          активен = $8
         WHERE material_id = $9 AND label_варианта = $10`,
        [
          variant.артикул_товара,
          variant.полное_наименование_варианта,
          variant.тип_варианта,
          variant.значение_варианта,
          variant.единица_варианта,
          variant.базовая_цена,
          variant.ссылка,
          variant.активен,
          materialId,
          variant.label_варианта
        ]
      )
    }
  }
}

function normalizeWorks(rawWorks) {
  const map = new Map()

  for (const work of rawWorks) {
    const name = normalizeWorkName(work.наименование_работы)
    const category = normalizeCategory(work.категория_работы, name)
    const existing = map.get(normalizeKey(name))

    if (!existing) {
      map.set(normalizeKey(name), {
        ...work,
        категория_работы: category,
        наименование_работы: name
      })
      continue
    }

    for (const priceKey of [
      'цена_0_300',
      'цена_300_600',
      'цена_600_1000',
      'цена_1000_3000',
      'цена_3000_6000',
      'цена_6000_15000',
      'цена_15000_30000',
      'цена_более_30000'
    ]) {
      existing[priceKey] = choosePrice(existing[priceKey], work[priceKey])
    }
  }

  return [...map.values()].sort((a, b) => {
    if (a.категория_работы !== b.категория_работы) {
      return a.категория_работы.localeCompare(b.категория_работы, 'ru')
    }
    return a.наименование_работы.localeCompare(b.наименование_работы, 'ru')
  })
}

function normalizeMaterialsAndVariants(rawMaterials, rawVariants) {
  const baseMap = new Map()
  const variantMap = new Map()

  for (const material of rawMaterials) {
    const normalized = normalizeMaterial(material)
    const existing = baseMap.get(normalized.base_key)

    if (!existing) {
      baseMap.set(normalized.base_key, normalized)
    } else {
      existing.базовая_цена = choosePrice(existing.базовая_цена, normalized.базовая_цена)
      if (!existing.артикул_товара && normalized.артикул_товара) {
        existing.артикул_товара = normalized.артикул_товара
      }
    }

    const derivedVariant = extractVariantFromMaterial(material, normalized)
    if (derivedVariant) {
      const key = `${derivedVariant.base_key}__${derivedVariant.label_варианта}`
      if (!variantMap.has(key)) {
        variantMap.set(key, derivedVariant)
      } else {
        variantMap.get(key).базовая_цена = choosePrice(variantMap.get(key).базовая_цена, derivedVariant.базовая_цена)
      }
    }
  }

  for (const rawVariant of rawVariants) {
    const normalizedVariant = normalizeVariant(rawVariant)
    if (!normalizedVariant) continue

    const key = `${normalizedVariant.base_key}__${normalizedVariant.label_варианта}`
    if (!variantMap.has(key)) {
      variantMap.set(key, normalizedVariant)
    } else {
      variantMap.get(key).базовая_цена = choosePrice(variantMap.get(key).базовая_цена, normalizedVariant.базовая_цена)
    }
  }

  const baseMaterials = [...baseMap.values()].sort((a, b) => a.базовое_наименование.localeCompare(b.базовое_наименование, 'ru'))
  const variants = [...variantMap.values()].sort((a, b) => {
    if (a.base_key !== b.base_key) return a.base_key.localeCompare(b.base_key, 'ru')
    return a.label_варианта.localeCompare(b.label_варианта, 'ru')
  })

  return { baseMaterials, variants }
}

function normalizeMaterial(material) {
  const source = `${material.базовое_наименование || material.полное_наименование_материала || ''}`.trim()
  const rule = findMaterialRule(source)

  if (!rule) {
    const baseName = cleanupBaseName(source)
    return {
      главная_категория: material.главная_категория || 'Прочее',
      подкатегория: material.подкатегория || '',
      артикул_товара: material.артикул_товара || '',
      полное_наименование_материала: baseName,
      единица_измерения: material.единица_измерения || '',
      базовая_цена: Number(material.базовая_цена || 0),
      ссылка: material.ссылка || '',
      базовое_наименование: baseName,
      бренд: material.бренд || '',
      модель: material.модель || '',
      тип_материала: material.тип_материала || '',
      base_key: normalizeKey(baseName)
    }
  }

  return {
    главная_категория: rule.главная_категория,
    подкатегория: rule.подкатегория,
    артикул_товара: '',
    полное_наименование_материала: rule.базовое_наименование,
    единица_измерения: material.единица_измерения || inferUnit(rule.key, source),
    базовая_цена: Number(material.базовая_цена || 0),
    ссылка: material.ссылка || '',
    базовое_наименование: rule.базовое_наименование,
    бренд: rule.бренд,
    модель: rule.модель,
    тип_материала: rule.тип_материала,
    base_key: rule.key
  }
}

function normalizeVariant(rawVariant) {
  const source = `${rawVariant.полное_наименование_варианта || rawVariant.base_key || ''}`.trim()
  const rule = findMaterialRule(source)
  if (!rule) return null

  return {
    base_key: rule.key,
    артикул_товара: rawVariant.артикул_товара || '',
    полное_наименование_варианта: source,
    тип_варианта: rawVariant.тип_варианта || inferVariantType(source),
    значение_варианта: Number(rawVariant.значение_варианта || 0),
    единица_варианта: rawVariant.единица_варианта || inferVariantUnit(source),
    label_варианта: rawVariant.label_варианта || buildVariantLabel(rawVariant.значение_варианта, rawVariant.единица_варианта),
    базовая_цена: Number(rawVariant.базовая_цена || 0),
    ссылка: rawVariant.ссылка || '',
    активен: rawVariant.активен ?? 1
  }
}

function extractVariantFromMaterial(material, normalized) {
  const name = `${material.полное_наименование_материала || ''}`

  const thickness = extractThicknessMm(name)
  if (thickness !== null && allowsThicknessVariant(normalized.base_key)) {
    return {
      base_key: normalized.base_key,
      артикул_товара: material.артикул_товара || '',
      полное_наименование_варианта: name,
      тип_варианта: 'толщина',
      значение_варианта: thickness,
      единица_варианта: 'мм',
      label_варианта: `${toCleanNumber(thickness)} мм`,
      базовая_цена: Number(material.базовая_цена || 0),
      ссылка: material.ссылка || '',
      активен: 1
    }
  }

  const length = extractLengthMeters(name)
  if (length !== null && allowsLengthVariant(normalized.base_key)) {
    return {
      base_key: normalized.base_key,
      артикул_товара: material.артикул_товара || '',
      полное_наименование_варианта: name,
      тип_варианта: 'длина',
      значение_варианта: length,
      единица_варианта: 'м',
      label_варианта: `${toCleanNumber(length)} м`,
      базовая_цена: Number(material.базовая_цена || 0),
      ссылка: material.ссылка || '',
      активен: 1
    }
  }

  const size = extractSizeToken(name)
  if (size && allowsSizeVariant(normalized.base_key)) {
    return {
      base_key: normalized.base_key,
      артикул_товара: material.артикул_товара || '',
      полное_наименование_варианта: name,
      тип_варианта: 'размер',
      значение_варианта: 0,
      единица_варианта: '',
      label_варианта: size,
      базовая_цена: Number(material.базовая_цена || 0),
      ссылка: material.ссылка || '',
      активен: 1
    }
  }

  return null
}

function normalizeWorkName(name) {
  const cleaned = cleanupText(name)
  return workNameMap[cleaned] || cleaned
}

function normalizeCategory(category, name) {
  const cleaned = cleanupText(category || '')
  if (cleaned) return cleaned
  if (/демонтаж/i.test(name)) return 'Демонтаж'
  if (/пароизоля/i.test(name)) return 'Пароизоляция'
  if (/теплоизоля/i.test(name) || /утепл/i.test(name)) return 'Теплоизоляция'
  if (/пвх/i.test(name) || /мембран/i.test(name)) return 'ПВХ мембрана'
  if (/битум/i.test(name) || /наплавл/i.test(name)) return 'БРМ'
  return 'Общие работы'
}

function findMaterialRule(source) {
  for (const rule of materialRules) {
    if (rule.test.some(pattern => pattern.test(source))) {
      return rule
    }
  }
  return null
}

function choosePrice(currentValue, nextValue) {
  const current = Number(currentValue || 0)
  const next = Number(nextValue || 0)
  if (!current && next) return next
  if (current && !next) return current
  if (!current && !next) return 0
  return Math.min(current, next)
}

function cleanupText(value) {
  return `${value || ''}`.replace(/\s+/g, ' ').replace(/\.+$/g, '').trim()
}

function cleanupBaseName(value) {
  return cleanupText(value)
    .replace(/\bтолщин[аы]\s*\d+[,.]?\d*\s*мм\b/gi, '')
    .replace(/\b\d+[,.]?\d*\s*мм\b/gi, '')
    .replace(/\b\d+[,.]?\d*\s*м\b/gi, '')
    .replace(/\s{2,}/g, ' ')
    .trim()
}


function extractThicknessMm(value) {
  const match = `${value}`.match(/(\d+(?:[.,]\d+)?)\s*мм\b/i)
  if (!match) return null
  return Number(String(match[1]).replace(',', '.'))
}

function extractLengthMeters(value) {
  const byMm = `${value}`.match(/(\d{4})\s*мм\b/i)
  if (byMm) {
    return Number(byMm[1]) / 1000
  }

  const byM = `${value}`.match(/(?:^|[\s,(])(\d+(?:[.,]\d+)?)\s*м\b/i)
  if (byM) {
    return Number(String(byM[1]).replace(',', '.'))
  }

  return null
}

function extractSizeToken(value) {
  const match = `${value}`.match(/(\d+\s*[*x×]\s*\d+)/i)
  return match ? match[1].replace(/\s+/g, '') : ''
}

function inferVariantType(source) {
  if (/мм/i.test(source)) return 'толщина'
  if (/\b\d+\s*м\b/i.test(source) || /\b\d{4}\s*мм\b/i.test(source)) return 'длина'
  return 'вариант'
}

function inferVariantUnit(source) {
  if (/мм/i.test(source)) return 'мм'
  if (/\b\d+\s*м\b/i.test(source) || /\b\d{4}\s*мм\b/i.test(source)) return 'м'
  return ''
}

function buildVariantLabel(value, unit) {
  if (!value) return 'Вариант'
  if (!unit) return `${toCleanNumber(value)}`
  return `${toCleanNumber(value)} ${unit}`
}

function toCleanNumber(value) {
  const number = Number(value || 0)
  if (Number.isInteger(number)) return String(number)
  return String(number).replace('.', ',')
}

function allowsThicknessVariant(baseKey) {
  return [
    'logicpir',
    'minwool',
    'xps',
    'pvc-vrp',
    'pvc-vsr',
    'fastener-telescope',
    'anchor',
    'screw',
    'l-profile',
    'ridge-profile',
    'joint-profile',
    'galv-600x600'
  ].includes(baseKey)
}

function allowsLengthVariant(baseKey) {
  return ['edge-rail', 'press-rail', 'pvc-walkway'].includes(baseKey)
}

function allowsSizeVariant(baseKey) {
  return ['drain-parapet', 'drain-roof', 'drain-outlet', 'pvc-metal'].includes(baseKey)
}

function inferUnit(ruleKey, source) {
  if (['paro-film', 'pvc-vrp', 'pvc-vsr', 'pvc-metal'].includes(ruleKey)) return 'м2'
  if (['logicpir', 'xps'].includes(ruleKey)) return 'м2'
  if (['minwool'].includes(ruleKey)) return 'м3'
  if (['double-tape', 'fastener-telescope', 'anchor', 'washer', 'screw', 'sealant', 'aerator', 'drain-roof', 'drain-parapet', 'drain-outlet'].includes(ruleKey)) return 'шт'
  if (['edge-rail', 'press-rail', 'l-profile', 'ridge-profile', 'joint-profile', 'pvc-walkway'].includes(ruleKey)) return 'м/п'
  if (['primer'].includes(ruleKey)) return 'кг'
  return ''
}
